{"id":5451,"date":"2020-04-30T17:14:41","date_gmt":"2020-04-30T17:14:41","guid":{"rendered":"https:\/\/visathing.com\/?p=5451"},"modified":"2020-10-25T07:22:58","modified_gmt":"2020-10-25T07:22:58","slug":"covid-19-alert","status":"publish","type":"post","link":"https:\/\/visathing.com\/covid-19-alert\/","title":{"rendered":"Covid-19 Alert"},"content":{"rendered":"<h5><span style=\"color: #3366ff;\">COVID-19 ALERT: STATE OF SHUT DOWN EXTENDED IN BANGLADESH UNTIL  15  July 2020 <\/span><\/h5>\n<ul>\n<li>Visa on arrival suspended for all nationalities. Flights from Iran, Bhutan, Maldives, Sri Lanka and Europe except UK are suspended until 30 June 2020; Bahrain, India, Kuwait, Malaysia, Oman, Qatar, Saudi Arabia, Singapore, Turkey and UAE suspended until 15 April 2020. Travelers outside the restricted countries with a valid visa must show a medical certificate (with English translation) obtained within 72 hours of travel.<\/li>\n<li>Suspension are not applicable for on travelers traveling on Diplomatic missions and their family members.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<h5><span style=\"color: #3366ff;\">COVID-19 ALERT: FOREIGNERS IN BANGLADESH<\/span><\/h5>\n<ul>\n<li>Any Foreigners currently residing in Bangladesh will be allowed to extend their visa for the upcoming 3 months in Bangladesh due to COVID-19 outbreak. They must apply to the Department of Passport and Immigration (DIP) with the relevant documents.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<h5><span style=\"color: #3366ff;\">COVID-19 ALERT: TRAVEL ADVISORY FOR THE OTHER COUNTRIES <\/span><\/h5>\n<p><strong>Afghanistan<\/strong><\/p>\n<p>Published 24.04.2020<br \/>\nFlights to Afghanistan are suspended.<br \/>\n&#8211; This does not apply to repatriation flights that bring back nationals of Afghanistan.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Albania<\/strong><\/p>\n<p>Published 29.04.2020<br \/>\nFlights to Albania are suspended.<br \/>\n&#8211; This does not apply to flights operated by Air Albania (ZB) from\/to Istanbul (IST).<br \/>\n&#8211; This does not apply to repatriation and emergency flights.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Angola<\/strong><\/p>\n<p>Published 03.06.2020<\/p>\n<p>Flights to Angola are suspended.<\/p>\n<p>&#8211; This does not apply to humanitarian flights.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Armenia<\/strong><\/p>\n<p>Published 17.04.2020<br \/>\n1. Passengers are not allowed to enter Armenia.<br \/>\n&#8211; This does not apply to:<br \/>\n&#8211; nationals and residents of Armenia;<br \/>\n&#8211; immediate family members of nationals of Armenia;<br \/>\n&#8211; diplomats and their immediate family members.<br \/>\n2. Passengers who are allowed to enter Armenia are subject to a 14 day quarantine.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Austria<\/strong><\/p>\n<p>Published 05.06.2020<br \/>\n1. Passengers arriving from a non-Schengen Member State are not allowed to enter Austria.<br \/>\n&#8211; This does not apply to nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland and their family members.<br \/>\n&#8211; This does not apply to passengers with a British passport and their family members.<br \/>\n&#8211; This does not apply to residents of Austria.<br \/>\n&#8211; This does not apply to passengers with a &#8220;D&#8221; visa issued by Austria.<br \/>\n2. Passengers are subject to self-quarantine for 14 days.<br \/>\n&#8211; This does not apply to passengers departing immediately.<br \/>\n&#8211; This does not apply to nationals and residents of Austria, Czechia, Germany, Hungary, Liechtenstein, Slovakia, Slovenia and Switzerland.<br \/>\n&#8211; This does not apply to passengers with a medical certificate with a negative Coronavirus (COVID-19) test result issued at most 4 days before arrival.<br \/>\n3. Flights arriving from Belarus, China (People&#8217;s Rep.), France, Iran, Italy, Netherlands, Russian Fed., Spain, Ukraine and United Kingdom are suspended.<\/p>\n<p><strong>Algeria<\/strong><\/p>\n<p>Published 17.04.2020<\/p>\n<p>Flights to Algeria are suspended.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Australia<\/strong><\/p>\n<p>Published 27.05.2020<br \/>\n1. Passengers are not allowed to enter Australia.<br \/>\n&#8211; This does not apply to nationals of Australia.<br \/>\n&#8211; This does not apply to the immediate family members of nationals of Australia.<br \/>\n&#8211; This does not apply to permanent residents of Australia and their immediate family members.<br \/>\n&#8211; This does not apply to nationals of New Zealand residing in Australia.<br \/>\n&#8211; This does not apply to diplomats accredited to Australia and currently resident in Australia, and their immediate family members.<br \/>\n2. Passengers and airline crew are required to self-isolate for a period of 14 days at their first arrival location in Australia. If their duration of stay is less than 14 days, they must self-isolate for the entire duration of stay.<br \/>\n&#8211; This does not apply to airline crew with the appropriate personal protective equipment.<br \/>\n3. Airline crew who are nationals or residents of Australia must self-isolate at their place of residence (or hotel) between flights, or for 14 days, whichever is shorter.<br \/>\nAirline crew who are not nationals or residents of Australia must self-isolate in their hotel on arrival until their next flight.<br \/>\n4. When passengers transit through Australia for 8 to 72 hours, they must go to mandatory quarantine at the state designated facility until the time of the departing flight.<br \/>\n5. For repatriation charter flights, airlines are advised to contact the Australian Border Force (ABF) as early as possible in the planning process. Airlines should not confirm or schedule flights before discussing arrangements with the ABF repatriation team.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Azerbaijan<\/strong><\/p>\n<p>Published 09.07.2020<\/p>\n<p>1. Passengers are not allowed to enter Azerbaijan until 1 August 2020.<br \/>\n&#8211; This does not apply to nationals and residents of Azerbaijan.<br \/>\n2. Passengers must have a medical certificate with a negative Coronavirus (COVID-19) test result issued at most 48 hours before departure.<br \/>\n3. Nationals of Azerbaijan arriving without a medical certificate with a negative Coronavirus (COVID-19) test result are subject to quarantine for 14 days.<br \/>\n4. A completed &#8220;Self-Isolation Form&#8221; must be presented upon arrival.<br \/>\n5. Suspension of e-visa issuance and visa on arrival facilities.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Argentina<\/strong><\/p>\n<p>Published 29.06.2020<\/p>\n<p>1. Flights to Argentina are suspended until 17 July 2020.<br \/>\n&#8211; This does not apply to repatriation and medical flights.<br \/>\n2. Nationals and residents of Argentina are subject to quarantine for 14 days.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Anguilla<\/strong><\/p>\n<p>Published 07.04.2020<\/p>\n<p>Airports in Anguilla are closed.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Antigua and Barbuda<\/strong><\/p>\n<p>Published 01.06.2020<\/p>\n<p>Passengers arriving in Antigua and Barbuda:<\/p>\n<p>&#8211; are subject to medical screening; and<\/p>\n<p>&#8211; must wear a mask; and<\/p>\n<p>&#8211; present a completed health declaration form.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Bangladesh<\/strong><\/p>\n<p>Published 06.07.2020<\/p>\n<p>1. Suspension of visa on arrival facilities.<br \/>\n-This does not apply to passengers traveling on business with a return\/onward ticket. They must:<br \/>\n&#8211; have a confirmation letter issued by the Bangladesh Board of Investment (BOI). The letter must contain a BOI registration number. The accredited inviting organization must notify the Immigration authorities prior to arrival, and<br \/>\n&#8211; have a medical certificate with a negative Coronavirus (COVID-19) test result issued at most 72 hours before arrival.<br \/>\n2. Flights from Bahrain, Bhutan, Hong Kong (SAR China), India, Kuwait, Maldives, Nepal, Oman, Saudi Arabia, Singapore and Thailand to Bangladesh are suspended.<br \/>\n3. Passengers with a visa must have a medical certificate with a negative Coronavirus (COVID-19) test result issued at most 72 hours before departure.<br \/>\n&#8211; This does not apply to passengers with a diplomatic or an official passport and their family members.<br \/>\n&#8211; This does not apply to passengers with a Laissez-Passer and their family members.<br \/>\n4. A completed &#8220;Health Declaration Form&#8221; must be presented upon arrival.<br \/>\n5. Passengers are subject to medical screening and quarantine.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Belarus<\/strong><\/p>\n<div class=\"svgMap-tooltip-content\">\n<div>Published 02.07.2020<br \/>\n1. A completed awareness questionnaire must be presented upon arrival.<br \/>\n&#8211; This does not apply to passengers in transit.<br \/>\n2. Passengers are subject to quarantine for 14 days.<\/div>\n<\/div>\n<p>&nbsp;<\/p>\n<p><strong>Belgium<\/strong><\/p>\n<p>Published 12.06.2020<\/p>\n<p>International travel likely to be open from June 15. Public transport is operating, where masks are mandatory.<\/p>\n<p>1. Passengers are not allowed to enter Belgium.<br \/>\nThis does not apply to:<br \/>\n&#8211; Nationals of EEA Member States and Switzerland, returning home.<br \/>\n&#8211; British nationals returning home.<br \/>\n&#8211; Nationals of Andorra, Monaco, Montenegro, North Macedonia (Rep.), San Marino, Serbia and Vatican City (Holy See) with proof of connection travel to their home country.<br \/>\n&#8211; Passengers with a long term residence permit or a long term &#8220;D&#8221; visa issued by EEA Member States, Switzerland or the United Kingdom, returning home.<br \/>\n&#8211; Family members of nationals of EEA Member States, Switzerland and of British nationals, returning home;<br \/>\n&#8211; Diplomats;<br \/>\n&#8211; Personnel of international and humanitarian organizations;<br \/>\n&#8211; Humanitarian aid workers;<br \/>\n&#8211; Military personnel;<br \/>\n&#8211; Effective 15 June 2020, passengers arriving from EEA Member States or Switzerland.<br \/>\n2. Belgium reintroduced border controls.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Bulgaria<\/strong><\/p>\n<p>Published 05.06.2020<br \/>\n1. Passengers are not allowed to enter.<br \/>\n&#8211; This does not apply to nationals of Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, San Marino, Slovakia, Slovenia, Spain, Sweden, Switzerland and Vatican City (Holy See).<br \/>\n&#8211; This does not apply to passengers with a British passport.<br \/>\n&#8211; This does not apply to family members of nationals of Bulgaria.<br \/>\n&#8211; This does not apply to passengers with a permanent or long term residence permit issued by Bulgaria and their family members.<br \/>\n&#8211; This does not apply to nationals and residents of Turkey when they transit through Bulgaria to return to their country of residence.<br \/>\n&#8211; This does not apply to nationals and residents of Serbia when they transit through Bulgaria to return to their country of residence.<br \/>\n&#8211; This does not apply to nationals and residents of Montenegro when they transit through Bulgaria to return to their country of residence.<br \/>\n&#8211; This does not apply to passengers with a long-term residence permit issued by an EU Member State returning via Bulgaria to their country of residence.<br \/>\n&#8211; This does not apply to the following passengers:<br \/>\na. health care professionals, health researchers and elderly care professionals;<br \/>\nb. transport personnel engaged in the carriage of goods, crews of aircraft engaged in commercial air transport and other transport personnel as necessary;<br \/>\nc. diplomats, officials of international organizations, military personnel and humanitarian workers in the performance of their duties;<br \/>\nd. persons traveling for humanitarian reasons.<br \/>\n2. Passengers are subject to quarantine for 14 days.<br \/>\n&#8211; This does not apply when arriving from Austria, Bosnia and Herzegovina, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Latvia, Lithuania, Luxembourg, Montenegro, Netherlands, Poland, Romania, Serbia, Slovakia, Slovenia or Spain.<br \/>\n3. Passengers arriving from Italy at Sofia airport (SOF) must fill out a questionnaire in the presence of a health inspector.<br \/>\n4. All passports and national ID cards issued to nationals of Bulgaria and which have expired on 13 March 2020 or later, are considered valid with a prolongation of 6 months. This is due to the Coronavirus (COVID-19) Pandemic.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Botswana<\/strong><\/p>\n<p>Published 04.06.2020<\/p>\n<p>Airports in Botswana are closed.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Brazil<\/strong><\/p>\n<p>Published 08.07.2020<\/p>\n<p>1. Passengers are not allowed to enter until 29 July 2020.<br \/>\n&#8211; This does not apply to nationals and residents of Brazil.<br \/>\n&#8211; This does not apply to an immediate family member or a curator of a national of Brazil. Spouses of a national of Brazil must have a Brazilian marriage certificate. If the certificate is not issued by Brazil, it must be apostilled by a consulate. A non-official translation in Portuguese is also required.<br \/>\n&#8211; This does not apply to passengers traveling on business.<br \/>\n&#8211; This does not apply to merchant seamen.<br \/>\n2. Passengers must have a medical certificate with a negative Coronavirus (COVID-19) test result.<br \/>\n&#8211; This does not apply to nationals and residents of Brazil.<br \/>\n&#8211; This does not apply to merchant seamen.<br \/>\n3. Passengers must arrive at one of the following airports: Brasilia DF (BSB), Rio de Janeiro (GIG), Sao Paulo Guarulhos (GRU), Sao Paulo Viracopos (VCP).<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Bolivia<\/strong><\/p>\n<p>Published 01.05.2020<\/p>\n<p>Bolivia&#8217;s borders are closed.<\/p>\n<p><strong>Burundi<\/strong><\/p>\n<p>Published 21.04.2020<\/p>\n<p>Flights to Burundi are suspended.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Belize<\/strong><\/p>\n<p>Published 05.06.2020<\/p>\n<p>Airports in Belize are closed.<\/p>\n<p>&#8211; This does not apply to nationals of Belize.<\/p>\n<p>&#8211; This does not apply to residents of Belize.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Brunei Darussalam<\/strong><\/p>\n<p>Published 20.04.2020<br \/>\n1. Passengers are not allowed to transit or enter Brunei Darussalam.<br \/>\n&#8211; This does not apply to nationals and residents of Brunei Darussalam.<br \/>\n2. All visa exemptions and Visa on Arrival are temporarily suspended.<br \/>\n3. All visa issued to passengers are temporarily suspended.<\/p>\n<p><strong>Bahrain<\/strong><\/p>\n<p>Published 03.06.2020<br \/>\n1. Suspension of visa on arrival facilities.<br \/>\n&#8211; This does not apply to passengers with a diplomatic, an official, a service or UN passport.<br \/>\n2. Passengers are not allowed to enter.<br \/>\n&#8211; This does not apply to nationals of Bahrain.<br \/>\n&#8211; This does not apply to residents of Bahrain.<br \/>\n&#8211; This does not apply to military personnel.<br \/>\n&#8211; This does not apply to passengers with a valid letter of Prior Permission Granted which is presented prior to boarding.<br \/>\n3. Passengers are subject to medical screening and quarantine.<br \/>\n4. Border crossing on the causeway has been temporarily suspended due to Coronavirus (COVID-19).<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Benin<\/strong><\/p>\n<p>Published 15.05.2020<\/p>\n<p>Passengers arriving in Cotonou (COO) are subject to medical screening at their own expense. They are subject to quarantine for 14 days.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Bhutan<\/strong><\/p>\n<p>Published 20.04.2020<br \/>\n1. Visa on arrival is suspended.<br \/>\n2. Passengers with a visa, work permit or other immigration permits issued by Bhutan and airline crew are not allowed to enter Bhutan if they arrive from or have visited or transited through a Coronavirus (COVID-19) affected country.<br \/>\n3. Airline crew are subject to thermal screening on arrival.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Bahamas<\/strong><\/p>\n<p>Published 29.05.2020<\/p>\n<ol>\n<li>Passengers are not allowed to enter.<\/li>\n<\/ol>\n<p>&#8211; This does not apply to nationals and residents of the Bahamas.<\/p>\n<ol start=\"2\">\n<li>Nationals and residents of the Bahamas must have a medical certificate with a negative Coronavirus (COVID-19) test result issued at most 7 days before arrival.<\/li>\n<li>Nationals and residents of the Bahamas are subject to quarantine.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<p><strong>Bulgaria<\/strong><\/p>\n<p>Published 05.06.2020<br \/>\n1. Passengers are not allowed to enter.<br \/>\n&#8211; This does not apply to nationals of Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, San Marino, Slovakia, Slovenia, Spain, Sweden, Switzerland and Vatican City (Holy See).<br \/>\n&#8211; This does not apply to passengers with a British passport.<br \/>\n&#8211; This does not apply to family members of nationals of Bulgaria.<br \/>\n&#8211; This does not apply to passengers with a permanent or long term residence permit issued by Bulgaria and their family members.<br \/>\n&#8211; This does not apply to nationals and residents of Turkey when they transit through Bulgaria to return to their country of residence.<br \/>\n&#8211; This does not apply to nationals and residents of Serbia when they transit through Bulgaria to return to their country of residence.<br \/>\n&#8211; This does not apply to nationals and residents of Montenegro when they transit through Bulgaria to return to their country of residence.<br \/>\n&#8211; This does not apply to passengers with a long-term residence permit issued by an EU Member State returning via Bulgaria to their country of residence.<br \/>\n&#8211; This does not apply to the following passengers:<br \/>\na. health care professionals, health researchers and elderly care professionals;<br \/>\nb. transport personnel engaged in the carriage of goods, crews of aircraft engaged in commercial air transport and other transport personnel as necessary;<br \/>\nc. diplomats, officials of international organizations, military personnel and humanitarian workers in the performance of their duties;<br \/>\nd. persons traveling for humanitarian reasons.<br \/>\n2. Passengers are subject to quarantine for 14 days.<br \/>\n&#8211; This does not apply when arriving from Austria, Bosnia and Herzegovina, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Latvia, Lithuania, Luxembourg, Montenegro, Netherlands, Poland, Romania, Serbia, Slovakia, Slovenia or Spain.<br \/>\n3. Passengers arriving from Italy at Sofia airport (SOF) must fill out a questionnaire in the presence of a health inspector.<br \/>\n4. All passports and national ID cards issued to nationals of Bulgaria and which have expired on 13 March 2020 or later, are considered valid with a prolongation of 6 months. This is due to the Coronavirus (COVID-19) Pandemic.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Bosnia and Herzegovina<\/strong><\/p>\n<p>Published 03.06.2020<br \/>\nPassengers are not allowed to enter Bosnia and Herzegovina.<br \/>\n&#8211; This does not apply to:<br \/>\n&#8211; nationals and residents of Bosnia and Herzegovina;<br \/>\n&#8211; nationals of Croatia, Montenegro and Serbia;<br \/>\n&#8211; spouses and children of nationals of Bosnia and Herzegovina;<br \/>\n&#8211; passengers returning via Bosnia and Herzegovina to their country of residence. They must have a permit issued by the competent authority of Bosnia and Herzegovina;<br \/>\n&#8211; passengers traveling on business with an invitation issued by a company based in Bosnia and Herzegovina. They must have a certificate with a negative Coronavirus (COVID-19) test result issued at most 48 hours before arrival;<br \/>\n&#8211; passengers traveling to participate in a funeral of a family member. They must have a death certificate and are allowed to stay for a maximum of 72 hours;<br \/>\n&#8211; passengers in need of emergency medical treatment;<br \/>\n&#8211; military forces of the NATO and other states participating in the partnership for Peace; and to NATO and EUFOR headquarters in Bosnia and Herzegovina;<br \/>\n&#8211; heads of state and members of their delegations whose arrival and departure has been announced by the competent authority.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Burkina Faso<\/strong><\/p>\n<p>Published 18.04.2020<\/p>\n<p>Bobo Dioulasso (BOY) and Ouagadougou (OUA) airports are closed.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Barbados<\/strong><\/p>\n<p>Published 25.05.2020<\/p>\n<p>Barbados (BGI) airport is closed.<\/p>\n<p>&#8211; This does not apply to technical stops, medevac flights and authorized flights.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Chile<\/strong><\/p>\n<p>Published 09.07.2020<\/p>\n<p>1. Passengers are not allowed to enter until 16 July 2020.<br \/>\n&#8211; This does not apply to nationals and residents of Chile.<br \/>\n2. Nationals and residents of Chile are subject to quarantine for 14 days.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Congo (Dem. Rep.)<\/strong><\/p>\n<p>Published 22.04.2020<\/p>\n<p>1.Flights to Congo (Dem. Rep.) are suspended.<\/p>\n<p>&#8211; This does not apply to pre-approved repatriation flights.<\/p>\n<p>2.Passengers and airline crew must go through medical screening upon arrival and present a completed Health Sanitary Card provided by Health Authorities.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Congo<\/strong><\/p>\n<p>Published 26.03.2020<\/p>\n<p>Airports in Congo are closed.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Cuba<\/strong><\/p>\n<p>Published 01.07.2020<\/p>\n<p>1. Flights to Cuba are suspended.<br \/>\n&#8211; This does not apply to humanitarian flights.<br \/>\n&#8211; This does not apply to flights landing in Cayo Coco (CCC), Cayo Largo del Sur (CYO) or Santa Clara (SNU).<br \/>\n2. Passengers are subject to quarantine for 14 days.<br \/>\n&#8211; This does not apply to passengers arriving in Cayo Coco (CCC), Cayo Largo del Sur (CYO) or Santa Clara (SNU).<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Cayman Islands<\/strong><\/p>\n<p>Published 14.05.2020<\/p>\n<p>Flights to Grand Cayman (GCM) are suspended.<\/p>\n<p>&#8211; This does not apply to emergency, repatriation and Medevac flights. They must obtain a prior approval from the Civil Aviation in Cayman Isl.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Canada<\/strong><\/p>\n<p>Published 13.07.2020<\/p>\n<p>1. Passengers are not allowed to enter Canada.<br \/>\n-This does not apply to:<br \/>\n&#8211; nationals of Canada;<br \/>\n&#8211; permanent residents of Canada;<br \/>\n&#8211; passengers arriving from the USA traveling for a purpose other than tourism;<br \/>\n&#8211; immediate family members of a national of a permanent resident of Canada. They must be traveling for a purpose other than tourism;<br \/>\n&#8211; passengers who do not need to obtain a temporary resident visa, and their immediate family members. They must be traveling for a purpose other than tourism;<br \/>\n&#8211; nationals of France who reside in Saint-Pierre-et-Miquelon and have been only in Saint-Pierre-et-Miquelon, the USA or Canada in the past 14 days. They must be traveling for a purpose other than tourism;<br \/>\n&#8211; Indians under the Indian Act;<br \/>\n&#8211; students;<br \/>\n&#8211; merchant seamen.<br \/>\n2. Passengers must arrive at Calgary (YYC), Montreal (YUL), Toronto (YYZ) or Vancouver (YVR).<br \/>\n3. Passengers are subject to quarantine for 14 days.<br \/>\n4. Passports issued to nationals of North Macedonia (Rep.) which have expired on 18 March 2020 or later, are considered valid until 31 July 2020.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Cambodia<\/strong><\/p>\n<p>Published 02.07.2020<\/p>\n<p>1. All visa exemptions, visas on arrival and e-visas are suspended.<br \/>\n&#8211; This does not apply to passengers with a diplomatic visa (Visa A) or an official visa (Visa B) issued by Cambodia.<br \/>\n2. Passengers must have a medical certificate with a negative Coronavirus (COVID-19) test result issued at most 72 hours before arrival.<br \/>\n&#8211; This does not apply to nationals of Cambodia.<br \/>\n&#8211; This does not apply to passengers with a diplomatic visa (Visa A) or an official visa (Visa B) issued by Cambodia.<br \/>\n3. Passengers must have a proof of insurance policy with a minimum value of USD 50,000. They must deposit USD 3,000 at a designated bank on arrival.<br \/>\n&#8211; This does not apply to nationals of Cambodia.<br \/>\n&#8211; This does not apply to passengers with a diplomatic visa (Visa A) or an official visa (Visa B) issued by Cambodia.<br \/>\n&#8211; This does not apply to nationals of Cambodia with a foreign passport and a Visa K entry permit issued by Cambodia.<br \/>\n4. Passengers are subject to medical screening and quarantine for 14 days.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Comoros<\/strong><\/p>\n<p>Published 12.06.2020<\/p>\n<ol>\n<li>Flights to Comoros are suspended.<\/li>\n<li>Passengers must have a medical certificate with a negative Coronavirus (COVID-19) test result issued before arrival.<\/li>\n<\/ol>\n<p><strong>Croatia<\/strong><\/p>\n<p>Published 10.06.2020<br \/>\n1. Passengers are not allowed to enter.<br \/>\nThis does not apply to:<br \/>\n-nationals of Croatia and their family members.<br \/>\n-passengers with a residence permit issued by Croatia.<br \/>\n-nationals of Austria, Belgium, Bulgaria, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland and their family members, if they are:<br \/>\n&#8211; returning to their country of residence; or<br \/>\n&#8211; traveling on business with an invitation letter; or<br \/>\n&#8211; traveling for tourism with confirmation of accommodation booking.<br \/>\n-passengers with a British passport and their family members, if they are:<br \/>\n&#8211; returning to their country of residence; or<br \/>\n&#8211; traveling on business with an invitation letter; or<br \/>\n&#8211; traveling for tourism with confirmation of accommodation booking.<br \/>\n-passengers with a long term residence permit or a long term &#8220;D&#8221; visa issued by Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or United Kingdom if they are:<br \/>\n&#8211; returning to their country of residence; or<br \/>\n&#8211; traveling on business with an invitation letter; or<br \/>\n&#8211; traveling for tourism with confirmation of accommodation booking.<br \/>\n-passengers entering Croatia to transit by land to a third country. They must prove that they can enter the destination country.<br \/>\n2. Passports and national ID cards issued to nationals of Croatia which have expired on 11 March 2020 or later, are considered valid.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>The Mainland of China<\/strong><\/p>\n<p>Published 12.06.2020<br \/>\n1. The mainland of China has decided to temporarily suspend the entry into the mainland of China by foreign nationals holding visas or residence permits still valid to the time of this announcement, effective from 00:00 local time, 28 March 2020. Entry by foreign nationals with APEC Business Travel Cards will be suspended as well.<br \/>\n&#8211; Policies including port visas, 24\/72\/144-hour visa-free transit policy, Hainan 30-day visa-free policy, 15-day visa-free policy specified for foreign cruise-group-tour through Shanghai Port, Guangdong 144-hour visa-free policy specified for foreign tour groups from Hong Kong or Macao SAR, and Guangxi 15-day visa-free policy specified for foreign tour groups of ASEAN countries will also be temporarily suspended. Entry with diplomatic, service, courtesy or C visas will not be affected.<br \/>\n&#8211; Foreign nationals coming to the mainland of China for necessary economic, trade, scientific or technological activities or out of emergency humanitarian needs may apply for visas at Chinese embassies or consulates.<br \/>\n&#8211; Entry by foreign nationals with visas issued after this announcement will not be affected.<br \/>\n2. All passengers arriving at PEK will have a PCR test and be quarantined at the designated location in Beijing for 14 days.<br \/>\n3. Passengers arriving at Shanghai Pudong (PVG) or Shanghai Hongqiao (SHA) must undergo a Nucleic Acid Test (NAT) and a 14-day quarantine in designated places for medical observation.<br \/>\n4. Passengers who live in or have been in France, Germany, Iran, Italy, Japan, Korea (Rep.), Spain or USA in the past 14 days arriving at Guangzhou (CAN) or Shenzhen (SZX) must undergo 14-day quarantine at home or in designated places for medical observation. All passengers arriving at SZX will have a PCR test.<br \/>\n5. All passengers arriving at XMN will be quarantined for medical observation at the designated hotels for 14 days on their own expenses.<br \/>\n&#8211; This does not apply to passengers under 18 years old, passengers above 70 years old, pregnant women and passengers suffering from illness. They must apply for permission to undergo a 14-day quarantine at home.<br \/>\n6. Airline crew of foreign airlines:<br \/>\n&#8211; are not required to undergo nucleic acid test if they have a short stay after landing then depart immediately, and do not leave apron during the transition; OR<br \/>\n&#8211; shall receive nucleic acid test in the first port of entry if they need to enter the country to rest or continue to operate domestic routes. The test results will be confirmed by the local government in accordance with the requirements of epidemic prevention management. Only if the test results are negative, crews can continue the operations; OR<br \/>\n&#8211; are allowed to return to their home country for isolation treatment when agreed by the local joint control mechanism, if they are symptomatic, in close contact with infected persons or tested positive. Airlines and crews shall make all commitments to bear their responsibilities and also carry out strict protections.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Cameroon<\/strong><\/p>\n<p>Published 02.06.2020<\/p>\n<ol>\n<li>Flights to Cameroon are suspended.<\/li>\n<\/ol>\n<p>&#8211; This does not apply to aircraft in state of emergency.<\/p>\n<p>&#8211; This does not apply to humanitarian flights (medevac, repatriation flights).<\/p>\n<ol start=\"2\">\n<li>Airline crew are subject to quarantine.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<p><strong>Central African Republic<\/strong><\/p>\n<p>Published 26.05.2020<\/p>\n<ol>\n<li>Bangui (BGF) is closed.<\/li>\n<\/ol>\n<p>&#8211; This does not apply to:<\/p>\n<p>&#8211; emergency flights;<\/p>\n<p>&#8211; technical landings;<\/p>\n<p>&#8211; humanitarian, medevac and repatriation flights;<\/p>\n<p>&#8211; flights with a special authorization<\/p>\n<ol start=\"2\">\n<li>Airline crew are subject to mandatory quarantine for the duration of their rotation or rest period.<\/li>\n<li>Passengers arriving from a country with local transmission of Coronavirus (COVID-19) must self-quarantine for 21 days upon arrival.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<p><strong>Chad<\/strong><\/p>\n<p>Published 26.04.2020<\/p>\n<p>Airports in Chad are closed.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Chinese Taipei<\/strong><\/p>\n<p>Published 01.05.2020<br \/>\n1. Passengers are not allowed to transit Chinese Taipei.<br \/>\n2. Passengers are not allowed to enter Chinese Taipei.<br \/>\n&#8211; This does not apply to passengers with a Chinese Taipei travel document.<br \/>\n&#8211; This does not apply to passengers with an Alien Resident Certificate.<br \/>\n&#8211; This does not apply to personnel on diplomatic or official business.<br \/>\n&#8211; This does not apply to passengers who can prove they are fulfilling commercial and contractual obligations, or passengers requiring special permission.<br \/>\n&#8211; This does not apply to passengers with a visa with &#8220;SPECIAL ENTRY PERMIT FOR COVID-19 OUTBREAK&#8221; stated on remarks.<br \/>\n3. Passengers allowed to enter must observe a 14-day home quarantine upon arrival.<br \/>\n4. All arriving passengers and crew members must present a completed Health Declaration Form.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Cape Verde<\/strong><\/p>\n<p>Published 22.04.2020<\/p>\n<p>Flights to Cape Verde are suspended.<\/p>\n<p>&#8211; This does not apply to special, repatriation and humanitarian flights.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Cote d&#8217;Ivoire<\/strong><\/p>\n<p>Published 08.07.2020<\/p>\n<p>1. Flights to Cote d&#8217;Ivoire are suspended.<br \/>\n&#8211; This does not apply to humanitarian, medevac and repatriation flights.<br \/>\n2. Airline crew are subject to quarantine.<br \/>\n3. Passengers are subject to medical screening and quarantine.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Cyprus<\/strong><\/p>\n<p>Published 11.06.2020<br \/>\n1. Passengers are not allowed to enter Cyprus.<br \/>\n&#8211; This does not apply to passengers arriving from Austria, Bulgaria, Croatia, Czechia, Denmark, Estonia, Finland, Germany, Greece, Hungary, Israel, Latvia, Lithuania, Luxembourg, Malta, Malta, Norway, Poland, Romania, Slovakia, Slovenia or Switzerland.<br \/>\n&#8211; This does not apply to residents of Cyprus.<br \/>\n&#8211; This does not apply to nationals of Cyprus arriving from a country other than Austria, Bulgaria, Croatia, Czechia, Denmark, Estonia, Finland, Germany, Greece, Hungary, Israel, Latvia, Lithuania, Luxembourg, Malta, Norway, Poland, Romania, Slovakia, Slovenia or Switzerland if they reside in Cyprus.<br \/>\n&#8211; This does not apply to family members of nationals of Cyprus arriving from a country other than Austria, Bulgaria, Croatia, Czechia, Denmark, Estonia, Finland, Germany, Greece, Hungary, Israel, Latvia, Lithuania, Luxembourg, Malta, Norway, Poland, Romania, Slovakia, Slovenia or Switzerland if the national of Cyprus resides in Cyprus.<br \/>\n2. Passengers who have been in a country other than Austria, Bulgaria, Croatia, Czechia, Denmark, Estonia, Finland, Germany, Greece, Hungary, Israel, Latvia, Lithuania, Luxembourg, Malta, Norway, Poland, Romania, Slovakia, Slovenia or Switzerland in the past 14 days are not allowed to enter.<br \/>\n&#8211; This does not apply to nationals and residents of Cyprus.<br \/>\n&#8211; This does not apply to family members of nationals of Cyprus.<\/p>\n<p>&#8211; Passengers older than 65 years are allowed to present a printed Passenger Locator Form upon arrival.<br \/>\n3. Passengers arriving from Austria, Bulgaria, Croatia, Czechia, Denmark, Estonia, Finland, Germany, Greece, Hungary, Israel, Latvia, Lithuania, Luxembourg, Malta, Norway, Poland, Romania, Slovakia, Slovenia or Switzerland must have a medical certificate stating a negative Coronavirus (COVID-19) test result issued within 72 hours before departure.<br \/>\n&#8211; Nationals and residents of Cyprus are subject to a Coronavirus (COVID-19) test if they do not have this medical certificate.<br \/>\n4. Nationals and residents of Cyprus arriving from a country other than Austria, Bulgaria, Croatia, Czechia, Denmark, Estonia, Finland, Germany, Greece, Hungary, Israel, Latvia, Lithuania, Luxembourg, Malta, Norway, Poland, Romania, Slovakia, Slovenia or Switzerland are subject to a Coronavirus (COVID-19) test and quarantine.<br \/>\n5. Family members of nationals of Cyprus arriving from a country other than Austria, Bulgaria, Croatia, Czechia, Denmark, Estonia, Finland, Germany, Greece, Hungary, Israel, Latvia, Lithuania, Luxembourg, Malta, Norway, Poland, Romania, Slovakia, Slovenia or Switzerland are subject to a Coronavirus (COVID-19) test and quarantine.<br \/>\nEffective from 20 June 2020:<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Czech Republic<\/strong><\/p>\n<p>Published 10.06.2020<br \/>\nPassengers are not allowed to enter.<br \/>\n&#8211; This does not apply to:<br \/>\n&#8211; nationals of Czechia.<br \/>\n&#8211; nationals of Austria, Germany, Hungary and Slovakia traveling directly from Austria, Germany, Hungary or Slovakia.<br \/>\n&#8211; British nationals and nationals of Andorra, Monaco, San Marino, Switzerland, Vatican City (Holy See) and an EEA Member State residing in Czechia. They must have one of the following documents:<br \/>\na. a European Health Insurance Card issued by Czechia; or<br \/>\nb. an employment contract with the place of work in Czechia; or<br \/>\nc. a confirmation of study in Czechia.<br \/>\n&#8211; passengers with a permanent residence permit issued by Czechia.<br \/>\n&#8211; passengers with a temporary residence permit issued by Czechia before 12 March 2020.<br \/>\n&#8211; passengers with a temporary residence permit issued by Czechia after 12 March 2020. They must have a medical certificate with a negative Coronavirus (COVID-19) test result issued at most 4 days before arrival.<br \/>\n&#8211; passengers with a D visa issued by Czechia before 12 March 2020.<br \/>\n&#8211; passengers with a D visa issued by Czechia after 12 March 2020. They must have a medical certificate with a negative Coronavirus (COVID-19) test result issued at most 4 days before arrival.<br \/>\n&#8211; residents of Austria, Germany, Hungary and Slovakia traveling directly from Austria, Germany, Hungary or Slovakia.<br \/>\n&#8211; passengers younger than 21 years who are children of British nationals and of nationals of Andorra, Monaco, San Marino, Switzerland, Vatican City (Holy See) and an EEA Member State residing in Czechia. They must have an original birth certificate or a copy, and a copy of the residence permit of the parent or a document confirming the residence in Czechia, such as a lease contract or a copy of the Czech national ID card of the parent.<br \/>\n&#8211; spouses of British nationals and of nationals of Andorra, Monaco, San Marino, Switzerland, Vatican City (Holy See) and an EEA Member State residing in Czechia. They must have an original marriage certificate or a copy (or a proof of the registered partnership) and a copy of the residence permit issued by Czechia or a document confirming the residence in Czechia, such as a lease contract or a copy of the Czech national ID card of the resident of Czechia.<br \/>\n&#8211; passengers with a C visa issued by Czechia, whose national comment section of the visa sticker includes SEZONNI. They must have a medical certificate with a negative Coronavirus (COVID-19) test result issued at most 4 days before arrival.<br \/>\n&#8211; passengers with a C visa issued by Czechia after 11 May 2020, whose national comment section of the visa sticker includes ZAMESTNANI, and their spouses and children if they have a visa and travel together with the holder of the C visa. They must have a medical certificate with a negative Coronavirus (COVID-19) test result issued at most 4 days before arrival.<br \/>\n&#8211; passengers with an official invitation and:<br \/>\na. a Laissez-Passer issued by the United Nations to staff of the United Nations and subordinate agencies under the Convention on Privileges and Immunities of Specialised Agencies adopted by the United Nations General Assembly on 21 November 1947 in New York; or<br \/>\nb. a Laissez-Passer issued by the European Union; or<br \/>\nc. a Laissez-Passer issued by the European Atomic Energy Community; or<br \/>\nd. a legitimacy certificate issued by the Secretary General of the Council of Europe.<br \/>\n&#8211; military personal with an official invitation and a military ID card together with a travel order, a travel warrant, or an individual or collective movement order.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Colombia<\/strong><\/p>\n<div class=\"svgMap-tooltip-title\">Published 01.07.2020<\/div>\n<div><\/div>\n<div class=\"svgMap-tooltip-content\">\n<div>1. Flights to Colombia are suspended until 31 August 2020.<br \/>\n&#8211; This does not apply to humanitarian flights.<br \/>\n2. Passengers are not allowed to enter or transit Colombia.<br \/>\n&#8211; This does not apply to:<br \/>\n&#8211; nationals and residents of Colombia;<br \/>\n&#8211; passengers with a diplomatic passport.<br \/>\n3. Passengers are subject to quarantine for 14 days.<br \/>\n4. Airline crew are subject to quarantine until their next flight.<br \/>\n5. A “Control Preventivo Contra el Coronavirus&#8221; must be completed prior to arrival.<\/div>\n<\/div>\n<p><strong>Costa Rica<\/strong><\/p>\n<p>Published 14.04.2020<\/p>\n<ol>\n<li>Passengers are not allowed to enter Costa Rica.<\/li>\n<\/ol>\n<p>&#8211; This does not apply to nationals of Costa Rica.<\/p>\n<p>&#8211; This does not apply to passengers who have left Costa Rica before 26 March 2020 or after 30 April 2020 and have:<\/p>\n<ol>\n<li>Permanent residence in Costa Rica; or<\/li>\n<li>Temporary residence in Costa Rica; or<\/li>\n<li>Special category (Categoria Especial); or<\/li>\n<li>Non-resident subcategory Stay (No Residente subcategory Estancia).<\/li>\n<li>Nationals and residents of Costa Rica must be in isolation for 14 days.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<div class=\"svgMap-tooltip-title\"><strong>Czechia<\/strong><\/div>\n<div><\/div>\n<div class=\"svgMap-tooltip-content\">\n<div>Published 01.07.2020<\/div>\n<div>1. Passengers are not allowed to enter.<br \/>\n&#8211; This does not apply to:<br \/>\n&#8211; nationals of Czechia;<br \/>\n&#8211; British nationals and nationals of Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Montenegro, Netherlands, Norway, Poland, Portugal, Romania, San Marino, Serbia, Slovakia, Slovenia, Spain, Sweden, Switzerland and Vatican City (Holy See);<br \/>\n&#8211; passengers with a residence permit issued by Czechia;<br \/>\n&#8211; passengers with a long-term residence permit issued by Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Montenegro, Netherlands, Norway, Poland, Portugal, Romania, San Marino, Serbia, Slovakia, Slovenia, Spain, Sweden, Switzerland, United Kingdom and Vatican City (Holy See);<br \/>\n&#8211; spouses of British nationals or of nationals of Andorra, Monaco, San Marino, Switzerland, Vatican City (Holy See) and an EEA Member State residing in Czechia. They must have an original marriage certificate or a copy (or a proof of the registered partnership) and a copy of the residence permit issued by Czechia or a document confirming the residence in Czechia, such as a lease contract or a copy of the Czech national ID card of the resident of Czechia;<br \/>\n&#8211; passengers younger than 21 years who are children of British nationals or of nationals of Andorra, Monaco, San Marino, Switzerland, Vatican City (Holy See) and an EEA Member State residing in Czechia. They must have an original birth certificate or a copy, and a copy of the residence permit of the parent or a document confirming the residence in Czechia, such as a lease contract or a copy of the Czech national ID card of the parent;<br \/>\n&#8211; passengers with a D visa issued by Czechia;<br \/>\n&#8211; passengers with a C visa issued by Czechia after 11 May 2020.<br \/>\n2. Passengers must have a medical certificate with a negative Coronavirus (COVID-19) PCR test result issued on arrival.<br \/>\n&#8211; This does not apply to passengers arriving from Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Montenegro, Netherlands, Norway, Poland, Portugal, Romania, San Marino, Serbia, Slovakia, Slovenia, Spain, Sweden, Switzerland, United Kingdom or Vatican City (Holy See).<\/div>\n<\/div>\n<p>&nbsp;<\/p>\n<p><strong>Dominican Republic<\/strong><\/p>\n<p>Published 03.05.2020<\/p>\n<p>Flights to Dominican Rep. are suspended.<\/p>\n<p><strong> <\/strong><\/p>\n<p><strong>Denmark<\/strong><\/p>\n<p>Published 14.07.2020<\/p>\n<p>1. Passengers are not allowed to enter.<br \/>\n-This does not apply to:<br \/>\n&#8211; nationals and residents of Denmark;<br \/>\n&#8211; residents of Andorra, Australia, Austria, Belgium, Bulgaria, Canada, Croatia, Cyprus, Czechia, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Japan, Korea (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, New Zealand, Norway, Poland, Romania, San Marino, Slovakia, Slovenia, Spain, Switzerland, Thailand, United Kingdom and Vatican City (Holy See) traveling as tourists. They must have proof of confirmed accommodation for at least 6 nights;<br \/>\n&#8211; residents of the Blekinge, Smaland, Skane and Vasterbotten regions in Sweden traveling as tourists. They must have proof of confirmed accommodation for at least 6 nights;<br \/>\n&#8211; spouse, partner, parent or child of nationals of Denmark residing in Denmark;<br \/>\n&#8211; spouse, partner, parent or child of nationals of Denmark not residing in Denmark. They must travel together;<br \/>\n&#8211; spouse, partner, parent or child of residents of Denmark;<br \/>\n&#8211; passengers returning directly via Denmark to their country of residence;<br \/>\n&#8211; passengers traveling on business;<br \/>\n&#8211; passengers traveling as students;<br \/>\n&#8211; merchant seamen.<\/p>\n<p><strong>Djibouti<\/strong><\/p>\n<p>Published 24.03.2020<\/p>\n<p>Flights to Djibouti are suspended.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Dominica<\/strong><\/p>\n<p>Published 16.04.2020<\/p>\n<p>1.Passengers are not allowed to enter Dominica.<\/p>\n<p>-This does not apply to nationals of Dominica who will be placed in a 14-day mandatory quarantine.<\/p>\n<p>2.Airline crew is not allowed to disembark.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Egypt<\/strong><\/p>\n<p>Published 01.07.2020<\/p>\n<p>1. Flights to Egypt restarted.<br \/>\n2. A completed &#8220;Public Health Card&#8221; must be presented to immigration upon arrival.<br \/>\n3. Passengers must have an insurance to cover medical expenses in Egypt.<br \/>\n&#8211; This does not apply to nationals and residents of Egypt.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Ethiopia<\/strong><\/p>\n<div class=\"svgMap-tooltip-content-wrapper\">\n<div class=\"svgMap-tooltip-content-container\">\n<div class=\"svgMap-tooltip-content\">\n<div>Published 06.07.2020<\/div>\n<div>1. Passengers must have a medical certificate with a negative Coronavirus (COVID-19) test result issued at most 72 hours before arrival.<br \/>\n2. Passengers without a medical certificate with a negative Coronavirus (COVID-19) test result issued at most 72 hours before arrival are subject to medical screening.<br \/>\n3. Passengers are subject to quarantine for 14 days partially at their own expense.<\/div>\n<\/div>\n<\/div>\n<\/div>\n<p><strong>Eswatini<\/strong><\/p>\n<p>Published 25.05.2020<\/p>\n<ol>\n<li>Passengers are not allowed to enter Eswatini.<\/li>\n<\/ol>\n<p>&#8211; This does not apply to nationals and residents of Eswatini.<\/p>\n<ol start=\"2\">\n<li>Nationals and residents of Eswatini are subject to quarantine in designated locations for a period of 14 days.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<p><strong>Ecuador<\/strong><\/p>\n<p>Published 12.06.2020<\/p>\n<ol>\n<li>Guayaquil (GYE) is closed.<\/li>\n<li>Passengers without a PCR test result for Coronavirus (COVID-19) will be tested upon arrival.<\/li>\n<li>Passengers must self-quarantine for 14 days.<\/li>\n<li>A completed Health Form and a completed Immigration form must be presented upon arrival.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<p><strong>Equatorial Guinea<\/strong><\/p>\n<p>Published 02.06.2020<\/p>\n<ol>\n<li>Flights to Equatorial Guinea are suspended.<\/li>\n<\/ol>\n<p>&#8211; This does not apply to aircraft in state of emergency.<\/p>\n<p>&#8211; This does not apply to humanitarian flights (medevac, repatriation flights).<\/p>\n<ol start=\"2\">\n<li>Passengers and airline crew are subject to quarantine.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<p><strong>El Salvador<\/strong><\/p>\n<p>Published 17.04.2020<\/p>\n<p>El Salvador (SAL) is closed.<\/p>\n<p>&#8211; This does not apply to US military flights (CSL), humanitarian aid flights, ambulance flights, ferry\/maintenance flights, repatriation flights with a special clearance.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Estonia<\/strong><\/p>\n<p>Published 07.07.2020<\/p>\n<p>1. Passengers are not allowed to enter.<br \/>\n-This does not apply to:<br \/>\n&#8211; nationals and residents of Estonia, Latvia and Lithuania;<br \/>\n&#8211; parent, child or spouse of nationals or residents of Estonia;<br \/>\n&#8211; passengers arriving from Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or United Kingdom. They must have no symptoms of illness and have stayed in those countries in the last 14 days;<br \/>\n&#8211; residents of Algeria, Australia, Canada, Georgia, Japan, Korea (Rep.), Montenegro, Morocco, New Zealand, Rwanda, Serbia, Thailand, Tunisia or Uruguay;<br \/>\n&#8211; passengers who are entering Estonia in order to go back home. They must not show any symptoms of Coronavirus (COVID-19);<br \/>\n&#8211; passengers traveling as students in Estonia.<br \/>\n2. Passengers are subject to self-isolation for 14 days.<br \/>\n&#8211; This does not apply to residents of Algeria, Australia, Austria, Belgium, Canada, Cyprus, Denmark, Estonia, Finland, France, Georgia, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Japan, Korea (Rep.), Latvia, Liechtenstein, Lithuania, Malta, Morocco, Netherlands, New Zealand, Norway, Poland, Rwanda, Slovakia, Slovenia, Spain, Switzerland, Thailand, Tunisia, United Kingdom or Uruguay.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Fiji<\/strong><\/p>\n<p>Published 30.03.2020<br \/>\n1. Passengers and airline crew are not allowed to enter Fiji.<br \/>\n&#8211; This does not apply to nationals of Fiji.<br \/>\n2. Nationals of Fiji must go into quarantine for a period of 14 days.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>France<\/strong><\/p>\n<p>Published 03.07.2020<\/p>\n<p>1. Passengers are not allowed to enter.<br \/>\n&#8211; This does not apply to:<br \/>\n&#8211; nationals of France, their spouses and children;<br \/>\n&#8211; nationals of Andorra, Monaco, San Marino, Switzerland, Vatican City (Holy See) and an EEA Member State, their spouses and children;<br \/>\n&#8211; British nationals, their spouses and children;<br \/>\n&#8211; passengers arriving from Andorra, Monaco, San Marino, Switzerland, United Kingdom, Vatican City (Holy See) or an EEA Member State;<br \/>\n&#8211; passengers arriving from Australia, Canada, Korea Rep., Georgia, Japan, Montenegro, Morocco, New-Zealand, Rwanda, Serbia, Thailand, Tunisia or Uruguay;<br \/>\n&#8211; passengers with a residence permit issued by France;<br \/>\n&#8211; passengers with a residence permit issued by Andorra, Monaco, San Marino, Switzerland, United Kingdom, Vatican City (Holy See) or an EEA Member State;<br \/>\n&#8211; merchant seamen;<br \/>\n&#8211; passengers traveling to study.<\/p>\n<p>2. Passengers arriving in France:<br \/>\n&#8211; are subject to quarantine or isolation; and<br \/>\n&#8211; must present a completed declaration on honor to state that they do not have symptoms of Coronavirus (COVID-19).<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Falkland Islands<\/strong><\/p>\n<p>Published 12.06.2020<\/p>\n<p>1.Passengers are not allowed to enter.<\/p>\n<p>&#8211; This does not apply to passengers with Falkland Isl. (Malvinas) status and residents of Falkland Isl. (Malvinas).<\/p>\n<p>2.Passengers with Falkland Isl. (Malvinas) status and residents of Falkland Isl. (Malvinas) are subject to quarantine for 14 days.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Finland<\/strong><\/p>\n<p>Published 06.07.2020<\/p>\n<p>Passengers are not allowed to enter.<br \/>\n&#8211; This does not apply to:<br \/>\n&#8211; passengers arriving from Denmark, Estonia, Iceland, Latvia, Lithuania or Norway;<br \/>\n&#8211; nationals of Finland and their family members;<br \/>\n&#8211; passengers with a residence permit issued by Finland;<br \/>\n&#8211; nationals and family members of nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden and Switzerland residing in Finland or returning via Finland to their country of residence;<br \/>\n&#8211; passengers with a British passport and their family members residing in Finland or returning via Finland to their country of residence;<br \/>\n&#8211; residents of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or the United Kingdom, returning via Finland to their country of residence;<br \/>\n&#8211; passengers arriving from Schengen Member States traveling on business;<br \/>\n&#8211; passengers studying in Finland, if arriving from another EU or Schengen Member State;<br \/>\n&#8211; military personnel.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Gabon<\/strong><\/p>\n<p>Published 06.07.2020<\/p>\n<p>1. Passengers arriving from Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland and United Kingdom are not allowed to enter.<br \/>\n&#8211; This does not apply to nationals and residents of Gabon.<br \/>\n2. Passengers must have a medical certificate with a negative Coronavirus (COVID-19) test result issued at most 5 days before arrival.<br \/>\n3. Passengers are subject to self- isolation for 14 days.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Ghana<\/strong><\/p>\n<p>Published 02.05.2020<\/p>\n<ol>\n<li>Flights to Ghana are suspended.<\/li>\n<\/ol>\n<p>&#8211; This does not apply to emergency flights, humanitarian flights, technical landing for refuel and medical evacuation flights.<\/p>\n<ol start=\"2\">\n<li>Airline crew will undergo mandatory quarantine during their rotation\/rest period.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<p><strong>Guadeloupe<\/strong><\/p>\n<p>Published 06.05.2020<\/p>\n<ol>\n<li>Passengers are not allowed to enter the French West Indies.<\/li>\n<\/ol>\n<p>&#8211; This does not apply to:<\/p>\n<p>&#8211; passengers who reside in the French West Indies;<\/p>\n<p>&#8211; passengers traveling for urgent health reasons;<\/p>\n<p>&#8211; passengers traveling for imperative business reasons.<\/p>\n<ol start=\"2\">\n<li>Passengers must go through a medical examination upon arrival and are subject to quarantine for a period of 14 days.<\/li>\n<\/ol>\n<p>&#8211; This does not apply to healthcare professionals related to Coronavirus (COVID-19).<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Guatemala<\/strong><\/p>\n<p>Published 07.05.2020<\/p>\n<p>Airports in Guatemala are closed.<\/p>\n<p>&#8211; This does not apply to humanitarian, military or ambulance flights.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Georgia<\/strong><\/p>\n<p>Published 18.03.2020<br \/>\n1. Passengers are not allowed to enter Georgia.<br \/>\n&#8211; This does not apply to nationals and residents of Georgia.<br \/>\n&#8211; This does not apply to representatives of diplomatic missions and international organizations and their family members accredited to Georgia.<br \/>\n&#8211; This does not apply to mixed families where one of the spouses or their under age child is a citizen of Georgia.<br \/>\n&#8211; This does not apply to passengers who are part of the humanitarian mission if trip of such mission (doctors, volunteers) becomes a necessity.<br \/>\n&#8211; This does not apply to passengers who have been granted the status of stateless persons by respective authorities of Georgia.<br \/>\n&#8211; This does not apply to passengers who are holding status neutral travel documents.<br \/>\n&#8211; This does not apply to passengers with a refugee status in Georgia.<br \/>\n2. Passengers with a residence permit issued by Georgia must get an OKTOBOARD before departing for Georgia.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Guinea<\/strong><\/p>\n<p>Published 14.05.2020<\/p>\n<p>Guinea&#8217;s borders are closed.<\/p>\n<p>&#8211; This does not apply to nationals of Guinea with an approval from the government and a medical certificate stating that the passenger is not affected by Coronavirus (COVID-19).<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Greenland<\/strong><\/p>\n<p>Published 24.04.2020<\/p>\n<p>Please see Coronavirus (COVID-19) regulations for Denmark.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Guyana<\/strong><\/p>\n<p>Published 07.05.2020<\/p>\n<p>Flights to Guyana are suspended.<\/p>\n<p>&#8211; This does not apply to:<\/p>\n<p>&#8211; Nationals and residents of Guyana.<\/p>\n<p>&#8211; Urgent health condition motive;<\/p>\n<p>&#8211; Professional trips which cannot be deferred as authorized;<\/p>\n<p>&#8211; Medevac flights;<\/p>\n<p>&#8211; Technical stops for fuel only and special authorized flights.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Guinea-Bissau<\/strong><\/p>\n<p>Published 26.05.2020<\/p>\n<p>Flights to Guinea-Bissau are suspended.<\/p>\n<p>This does not apply to:<\/p>\n<p>&#8211; emergency flights;<\/p>\n<p>&#8211; humanitarian, medical and rescue flights;<\/p>\n<p>&#8211; technical stops without passenger disembarkation;<\/p>\n<p>&#8211; other operational flights related to security.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Grenada<\/strong><\/p>\n<p>Published 17.04.2020<\/p>\n<p>Maurice Bishop International Airport (GND) and Lauriston Airport (CRU) are closed for all passenger traffic.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Gambia<\/strong><\/p>\n<p>Published 10.06.2020<\/p>\n<p>Flights to Gambia are suspended.<\/p>\n<p>&#8211; This does not apply to humanitarian, medevac and repatriation flights.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Greece<\/strong><\/p>\n<p>Published 10.07.2020<\/p>\n<p>1. Passengers are not allowed to enter.<br \/>\n-This does not apply to:<br \/>\n&#8211; nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden and Switzerland and their family members;<br \/>\n&#8211; British nationals and their family members;<br \/>\n&#8211; nationals of Algeria, Australia, Canada, Georgia, Japan, Korea (Rep.), Montenegro, Morocco, New Zealand, Rwanda, Thailand, Tunisia and Uruguay;<br \/>\n&#8211; residents of Algeria, Australia, Canada, Georgia, Japan, Korea (Rep.), Montenegro, Morocco, New Zealand, Rwanda, Thailand, Tunisia and Uruguay;<br \/>\n&#8211; passengers with a residence permit issued by Greece. A certificate of application for renewal of a residence permit is not accepted;<br \/>\n&#8211; passengers with a residence permit issued by Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or the United Kingdom;<br \/>\n&#8211; passengers with a long term visa issued by Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or the United Kingdom;<br \/>\n&#8211; nationals of North Macedonia (Rep.) returning via Thessaloniki (SKG) to continue by road to North Macedonia (Rep.). Their trip must be prearranged by the authorities;<br \/>\n&#8211; military personnel.<br \/>\n2. Passengers are subject to medical screening and quarantine for 1 or 14 days.<br \/>\n3. Flights from Sweden and the United Kingdom are suspended.<br \/>\n&#8211; This does not apply to humanitarian, medevac, military and repatriation flights.<br \/>\n4. Flights from Turkey are suspended until 15 July 2020.<br \/>\n&#8211; This does not apply to humanitarian, medevac, military and repatriation flights.<\/p>\n<p><strong>Germany<\/strong><\/p>\n<div class=\"svgMap-tooltip-title\"><\/div>\n<div class=\"svgMap-tooltip-content\">\n<div>Published 06.07.2020<\/div>\n<div>1. Passengers are not allowed to enter.<br \/>\nThis does not apply to:<br \/>\n&#8211; passengers arriving from Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or United Kingdom;<br \/>\n&#8211; nationals of Germany;<br \/>\n&#8211; passengers with a residence permit issued by Germany;<br \/>\n&#8211; residents of Australia, Canada, Georgia, Montenegro, New Zealand, Thailand, Tunisia and Uruguay;<br \/>\n&#8211; passengers with a &#8220;D&#8221; Visa issued by Germany;<br \/>\n&#8211; husband, wife, child and registered partner of nationals or residents of Germany;<br \/>\n&#8211; nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland and their family members returning via Germany to their country of residence;<br \/>\n&#8211; British nationals and their family members returning via Germany to their country of residence;<br \/>\n&#8211; passengers in transit to their home country, if there is no other travel option. The purpose of travel and the entry requirements for the destination and transit countries must be proved;<br \/>\n&#8211; US military personnel stationed in Germany and their family members；<br \/>\n&#8211; merchant seamen who are going to sign up on board or leave Germany for the purpose of repatriation.<br \/>\n2. Passengers are not allowed to transit if arriving from a non-Schengen Member State to another Schengen Member State.<br \/>\n&#8211; This does not apply to nationals of EEA Member States and Switzerland.<br \/>\n&#8211; This does not apply to British nationals.<br \/>\n&#8211; This does not apply to family members of nationals of EEA Member States and Switzerland.<br \/>\n&#8211; This does not apply to family members of British nationals.<br \/>\n&#8211; This does not apply to residents of EEA Member States and Switzerland.<br \/>\n&#8211; This does not apply to residents of Australia, Canada, Georgia, Montenegro, New Zealand, Thailand, Tunisia and Uruguay.<br \/>\n3. For more information, please refer to the website &lt;a href=&#8221;https: www.bundespolizei.de=&#8221;&#8221; web=&#8221;&#8221; de=&#8221;&#8221; 04aktuelles=&#8221;&#8221; 01meldungen=&#8221;&#8221; 2020=&#8221;&#8221; 03=&#8221;&#8221; 200317_faq.html;jsessionid=&#8221;97A3BB54ABD2E6A6A7D1D39F30BEC55C.2_cid324?nn=5931604#doc13824392bodyText2&#8243;&#8221;&gt;https:\/\/www.bundespolizei.de\/Web\/DE\/04Aktuelles\/01Meldungen\/2020\/03\/200317_faq.html;jsessionid=97A3BB54ABD2E6A6A7D1D39F30BEC55C.2_cid324?nn=5931604#doc13824392bodyText2 .<br \/>\n4. Passengers are subject to quarantine for 14 days.&lt;\/a href=&#8221;https:&gt;<\/div>\n<\/div>\n<p>&nbsp;<\/p>\n<p><strong>Haiti<\/strong><\/p>\n<p>Published 14.04.2020<\/p>\n<p>Flights to Port-au-Prince (PAP) and Cap-Haitien (CAP) are suspended.<\/p>\n<p>&#8211; This does not apply to emergency, humanitarian, medevac and government flights.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Honduras<\/strong><\/p>\n<p>Published 22.04.2020<\/p>\n<p>Airports in Honduras are closed.<\/p>\n<p>&#8211; This does not apply to humanitarian flights with an authorization issued 24h before departure by the Secretariat of tourism or Secretariat for foreign relations and international cooperation of Honduras.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Hungary<\/strong><\/p>\n<p>Published 11.06.2020<br \/>\n1. Passengers are not allowed to enter.<br \/>\n&#8211; This does not apply to nationals of Hungary.<br \/>\n&#8211; This does not apply to residents of Hungary who are nationals of an EEA Member State or Switzerland.<br \/>\n&#8211; This does not apply to nationals of Austria, Czechia and Slovakia.<br \/>\n&#8211; This does not apply to nationals of Slovenia if arriving from Slovenia.<br \/>\n&#8211; This does not apply to nationals of Germany, Japan, Korea (Rep.) and Poland travelling on business. They must arrive from their home country.<br \/>\n&#8211; This does not apply to nationals of Bulgaria if travelling on purpose of performing an official duty, participating in the activity of an international organization, travelling for business, performing humanitarian activity or visiting a relative.<br \/>\n&#8211; This does not apply to nationals or residents of Austria, Croatia, Moldova (Rep.), Romania, Serbia, Slovakia, Slovenia and Ukraine on humanitarian transit to their country of residence.<br \/>\n&#8211; This does not apply to passengers with a signed and stamped letter issued by the Deputy-Chief Officer of the National Police.<br \/>\n2. Nationals of Hungary are subject to quarantine.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>India<\/strong><\/p>\n<p>Published 06.07.2020<\/p>\n<p>Flights to India are suspended until 31 July 2020.<br \/>\n&#8211; This does not apply to humanitarian, medical and relief flights.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Indonesia<\/strong><\/p>\n<p>Published 10.07.2020<\/p>\n<p>1. Passengers are not allowed to enter and transit.<br \/>\n&#8211; This does not apply to nationals of Indonesia.<br \/>\n&#8211; This does not apply to passengers with a Temporary Stay Permit (ITAS) or Permanent Stay Permit (ITAP).<br \/>\n&#8211; This does not apply to passengers with a diplomatic or a service visa.<br \/>\n&#8211; This does not apply to passengers with a diplomatic or service stay permit.<br \/>\n&#8211; This does not apply to passengers with a visa issued after 31 March 2020.<br \/>\n2. Passengers and airline crew must have a medical certificate with a negative Coronavirus (COVID-19) PCR test result issued at most 7 days before arrival.<br \/>\n3. Passengers without a medical certificate with a negative Coronavirus (COVID-19) PCR test result are subject to medical screening and quarantine for 14 days.<br \/>\n4. Airline crew without a medical certificate with a negative Coronavirus (COVID-19) PCR test result are subject to medical screening and quarantine until their next flight.<br \/>\n5. Deadhead crew will be given an entry stamp. They must:<br \/>\n&#8211; have a valid crew ID card or crew member certificate;<br \/>\n&#8211; provide written notification to Immigration Officer proving they will be on duty on the return flight. The notification must be received by Immigration Officer minimum 24 hours from arrival.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Iran<\/strong><\/p>\n<p>Published 22.05.2020<br \/>\n1. Nationals of China (People&#8217;s Rep.) with a normal passport, passengers with a Hong Kong (SAR China) passport and passengers with a Macao (SAR China) passport are no longer visa exempt. However, they can obtain a visa on arrival.<br \/>\n2. Passengers are subject to medical screening and quarantine.<br \/>\n3. A completed self-declaration form concerning Coronavirus (COVID-19) must be presented upon arrival.<br \/>\n4. Based on the travel advisory restriction issued by United Arab Emirates Government, nationals of United Arab Emirates are not allowed to travel to Iran.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Iceland (Rep.)<\/strong><\/p>\n<div class=\"svgMap-tooltip-content\">Published 15.06.2020<\/div>\n<div class=\"svgMap-tooltip-content\">1. Passengers are not allowed to enter Iceland.<br \/>\n&#8211; This does not apply to:<br \/>\n&#8211; nationals of EEA Member States and Switzerland;<br \/>\n&#8211; passengers with a British passport;<br \/>\n&#8211; passengers with a residence permit issued by a Schengen Member State;<br \/>\n&#8211; family members of nationals of EEA Member States, Switzerland and of British nationals;<br \/>\n&#8211; diplomats;<br \/>\n&#8211; health and care workers traveling on duty;<br \/>\n&#8211; humanitarian aid workers;<br \/>\n&#8211; international organizations personnel;<br \/>\n&#8211; passengers that require international protection;<br \/>\n&#8211; passengers traveling on family emergencies;<br \/>\n&#8211; members of armed forces traveling on duty.<br \/>\n2. Passengers traveling through Iceland on their way to another Schengen Member State must have a written confirmation of their permission to enter the other Schengen Member State.<br \/>\n3. Passengers are subject to a Coronavirus (COVID-19) test or quarantine for 14 days.<br \/>\n&#8211; This does not apply to passengers arriving from Faroe Isl. or Greenland.<\/div>\n<p><strong>Iraq<\/strong><\/p>\n<p>Published 24.04.2020<br \/>\nFlights to Iraq are suspended.<br \/>\n&#8211; This does not apply to red cross, humanitarian, Medevac, repatriation, emergency and military flights.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Israel<\/strong><\/p>\n<p>Published 22.05.2020<br \/>\nPassengers are not allowed to transit or enter Israel.<br \/>\n&#8211; This does not apply to:<br \/>\n&#8211; nationals and residents of Israel.<br \/>\n&#8211; passengers with an entry approval issued by the Population and Immigration Authority of Israel or the Ministry of Foreign Affairs of Israel.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Ireland<\/strong><\/p>\n<p>Published 29.05.2020<\/p>\n<p>All the Ireland Residence permissions\/Visas that are due to expire from 20\/5\/2020 to 20\/7\/2020 are automatically renewed by the Minister for a period of 2 months. The renewal of permission is on the same basis as the existing permission and the same conditions attach.<\/p>\n<p>Passengers arriving in Ireland (Rep.) are required to self-quarantine for 14 days and complete a Public Health Passenger Locator Form.<\/p>\n<p>&#8211; This does not apply when arriving from Northern Ireland.<br \/>\n&#8211; This does not apply to passengers with a diplomatic passport.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Italy<\/strong><\/p>\n<p>Published 13.07.2020<\/p>\n<p>1. Passengers are not allowed to enter.<br \/>\n&#8211; This does not apply to:<br \/>\n&#8211; passengers arriving from Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or United Kingdom;<br \/>\n&#8211; nationals or residents of Italy;<br \/>\n&#8211; passengers traveling on business;<br \/>\n&#8211; passengers returning via Italy to their country of residence;<br \/>\n&#8211; passengers arriving from Algeria, Australia, Canada, Georgia, Japan, Korea (Rep.), Montenegro, Morocco, New Zealand, Rwanda, Serbia, Thailand, Tunisia or Uruguay.<br \/>\n2. Passengers who have transited through or have been in Armenia, Bahrain, Bangladesh, Bosnia and Herzegovina, Brazil, Chile, Dominican Rep., Kuwait, Moldova (Rep.), North Macedonia (Rep.), Oman, Panama or Peru in the past 14 days are not allowed to enter.<br \/>\nThis does not apply to:<br \/>\n&#8211; nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden and Switzerland who were residing in Italy before 9 July 2020;<br \/>\n&#8211; British nationals who were residing in Italy before 9 July 2020.<br \/>\n3. Residence permits issued by Italy which have expired between 31 January and 31 July 2020, are considered valid until 31 August 2020.<br \/>\n4. Passengers must present a completed self-declaration form to the transporting carrier and must communicate their entry to the Department of Prevention at local health units (ASL) of the entrance district.<br \/>\n&#8211; This does not apply to passengers arriving from Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or United Kingdom.<br \/>\n5. Passengers arriving in Sardinia must present a completed &#8220;Health Declaration Form&#8221; upon arrival.<br \/>\n6. Passengers arriving in Calabria must present a completed &#8220;Health Declaration Form&#8221; upon arrival.<br \/>\n7. Passengers arriving in Puglia must present a completed &#8220;Health Declaration Form&#8221; upon arrival.<br \/>\n8. Passengers arriving in Sicily must present a completed &#8220;Health Declaration Form&#8221; upon arrival.<br \/>\n9. Passengers are subject to quarantine for 14 days.<\/p>\n<p><strong>Japan<\/strong><\/p>\n<p>Published 01.07.2020<\/p>\n<p>1. Passengers who have transited through or have been in Afghanistan, Albania, Algeria, Andorra, Antigua and Barbuda, Argentina, Armenia, Australia, Austria, Azerbaijan, Bahamas, Bahrain, Bangladesh, Barbados, Belarus, Belgium, Bolivia, Bosnia and Herzegovina, Brazil, Brunei Darussalam, Bulgaria, Cameroon, Canada, Cape Verde, Central African Rep., Chile, China (People&#8217;s Rep.), Chinese Taipei, Congo (Dem. Rep.), Colombia, Costa Rica, Cote d&#8217;Ivoire, Croatia, Cuba, Cyprus, Czechia, Denmark, Djibouti, Dominica, Dominican Rep., Ecuador, Egypt, El Salvador, Equatorial Guinea, Estonia, Eswatini, Finland, France, Gabon, Georgia, Germany, Ghana, Greece, Grenada, Guatemala, Guinea, Guinea-Bissau, Guyana, Haiti, Honduras, Hong Kong (SAR China), Hungary, Iceland, India, Indonesia, Iran, Iraq, Ireland (Rep.), Israel, Italy, Jamaica, Kazakhstan, Korea (Rep.), Kosovo (Rep.), Kuwait, Kyrgyzstan, Latvia, Lebanon, Liechtenstein, Lithuania, Luxembourg, Macao (SAR China), Malaysia, Maldives, Malta, Mauritania, Mauritius, Mexico, Moldova (Rep.), Monaco, Montenegro, Morocco, Netherlands, New Zealand, Nicaragua, North Macedonia (Rep.), Norway, Oman, Pakistan, Panama, Peru, Philippines, Poland, Portugal, Qatar, Romania, Russian Fed., San Marino, Sao Tome and Principe, Saudi Arabia, Senegal, Serbia, Singapore, Slovakia, Slovenia, South Africa, Spain, St. Kitts and Nevis, St. Vincent and the Grenadines, Sweden, Switzerland, Tajikistan, Thailand, Turkey, Uruguay, USA, Ukraine, United Arab Emirates, United Kingdom, Vatican City (Holy See) or Viet Nam in the past 14 days are not allowed to enter until 31 July 2020.<br \/>\n&#8211; This does not apply to nationals of Japan.<br \/>\n&#8211; This does not apply to spouses or children of nationals of Japan if they can prove it.<br \/>\n&#8211; This does not apply to residents of Japan with “Permanent Resident&#8221;, &#8220;Spouse or Child of Japanese National&#8221;, &#8220;Spouse or Child of Permanent Resident&#8221; or &#8220;Long Term Resident&#8221;, who have departed Japan with Re-entry Permission by 2 April 2020.<br \/>\n&#8211; This does not apply to residents of Japan with “Permanent Resident&#8221;, &#8220;Spouse or Child of Japanese National&#8221;, &#8220;Spouse or Child of Permanent Resident&#8221; or &#8220;Long Term Resident&#8221;, who have departed Japan with Re-entry Permission between 3 April and 28 April 2020 and have only been in Afghanistan, Antigua and Barbuda, Argentina, Azerbaijan, Bahamas, Bangladesh, Barbados, Belarus, Cape Verde, Colombia, Djibouti, Dominican Rep., El Salvador, Equatorial Guinea, Gabon, Ghana, Guinea, Guinea Bissau, Honduras, India, Kazakhstan, Kuwait, Kyrgyzstan, Mexico, Maldives, Oman, Pakistan, Peru, Qatar, Russian Fed., Sao Tome and Principe, Saudi Arabia, South Africa, St. Kitts and Nevis, Tajikistan, United Arab Emirates, Ukraine or Uruguay.<br \/>\n&#8211; This does not apply to residents of Japan with “Permanent Resident&#8221;, &#8220;Spouse or Child of Japanese National&#8221;, &#8220;Spouse or Child of Permanent Resident&#8221; or &#8220;Long Term Resident&#8221;, who have departed Japan with Re-entry Permission between 29 April and 15 May 2020 and have only been in Afghanistan, Argentina, Azerbaijan, Bahamas, Bangladesh, Cape Verde, Colombia, El Salvador, Equatorial Guinea, Gabon, Ghana, Guinea, Guinea Bissau, Honduras, India, Kazakhstan, Kyrgyzstan, Mexico, Maldives, Pakistan, South Africa, Sao Tome and Principe, Tajikistan or Uruguay.<br \/>\n&#8211; This does not apply to residents of Japan with “Permanent Resident&#8221;, &#8220;Spouse or Child of Japanese National&#8221;, &#8220;Spouse or Child of Permanent Resident&#8221; or &#8220;Long Term Resident&#8221;, who have departed Japan with Re-entry Permission between 16 May and 26 May 2020 and have only been in Afghanistan, Argentina, Bangladesh, El Salvador, Ghana, Guinea, India, Kyrgyzstan, Pakistan, South Africa or Tajikistan.<br \/>\n&#8211; This does not apply to residents of Japan with “Permanent Resident&#8221;, &#8220;Spouse or Child of Japanese National&#8221;, &#8220;Spouse or Child of Permanent Resident&#8221; or &#8220;Long Term Resident&#8221;, who have departed Japan with Re-entry Permission between 27 May and 30 June 2020 and have only been in Algeria, Cameroon, Central African Rep., Costa Rica, Cuba, Eswatini, Georgia, Grenada, Guatemala, Guyana, Haiti, Iraq, Jamaica, Lebanon, Mauritania, Nicaragua, Senegal or St. Vincent and the Grenadines.<br \/>\n&#8211; This does not apply to passengers with a Special Permanent Residence Permit. However, they must have a Re-entry Permit from a regional immigration officer.<br \/>\n&#8211; This does not apply to US military personnel.<br \/>\n2. A completed &#8220;Quarantine Questionnaire&#8221; must be presented upon arrival.<br \/>\n3. Passengers and airline crew are subject to medical screening.<br \/>\n4. Visa exemption for passengers with passengers with a British passport, Hong Kong (SAR China) passport, Macao (SAR China) passport is suspended.<br \/>\n5. Visa exemption for nationals of Andorra, Argentina, Austria, Bahamas, Barbados, Belgium, Brunei Darussalam, Bulgaria, Costa Rica, Croatia, Czechia, Cyprus, Denmark, Dominican Rep., El Salvador, Estonia, Finland, France, Germany, Greece, Guatemala, Honduras, Hungary, Iceland, Indonesia, Iran, Ireland (Rep.), Israel, Italy, Korea (Rep.), Latvia, Lesotho, Liechtenstein, Lithuania, Luxembourg, Malaysia, Malta, Mexico, Monaco, Netherlands, Norway, Peru, Poland, Portugal, Romania, San Marino, Singapore, Slovakia, Slovenia, Spain, Suriname, Sweden, Switzerland, Thailand, Tunisia, United Arab Emirates, Uruguay and Vatican City (Holy See) is suspended.<br \/>\n6. Visa exemption for nationals of Azerbaijan, Bangladesh, Cambodia, Colombia, Georgia, India, Kazakhstan, Lao People&#8217;s Dem. Rep., Mongolia, Myanmar, Nauru, Oman, Pakistan, Palau, Papua New Guinea, Paraguay, Qatar, Samoa, Solomon Isl., Turkmenistan, Ukraine, Uzbekistan and Viet Nam with a diplomatic, official or service passport is suspended.<br \/>\n7. Visa exemption granted to passengers with an APEC Business Travel Card issued by Brunei Darussalam, China (People&#8217;s Rep.), Hong Kong (SAR China), Indonesia, Korea (Rep.), Malaysia, Mexico, Papua New Guinea, Peru, Philippines, Russian Fed., Singapore, Thailand or Viet Nam, is suspended.<br \/>\n8. Nationals of China (People&#8217;s Rep.) with a passport issued in Hubei Province or Zhejiang Province (China People&#8217;s Rep.) are not allowed to enter Japan.<br \/>\n&#8211; This does not apply when passengers can prove that they have not been in Hubei Province and Zhejiang Province the last 14 days.<br \/>\n9. Passengers who were in the cruise ship &#8216;Westerdam&#8217; are not allowed to enter Japan. &#8211; This does not apply to nationals of Japan.<br \/>\n10. Visas issued on or before 8 March 2020 by the Embassies, Consulates-General and Consulate of Japan in China (People&#8217;s Rep.), Hong Kong (SAR China), Korea (Rep.) or Macao (SAR China) are invalidated.<br \/>\n11. Visas issued on or before 20 March 2020 by the Embassies, Consulates-General and Consulate of Japan in Andorra, Austria, Belgium, Bulgaria, Croatia, Czechia, Cyprus, Denmark, Egypt, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Iran, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, San Marino, Slovakia, Slovenia, Spain, Sweden, Switzerland, United Kingdom or Vatican City (Holy See) are invalidated.<br \/>\n12. Visas issued on or before 27 March 2020 by the Embassies, Consulates-General and Consulate of Japan in Bahrain, Brunei Darussalam, Congo (Dem. Rep.), Indonesia, Israel, Malaysia, Philippines, Qatar, Singapore, Thailand or Viet Nam are invalidated.<br \/>\n13. Visas issued on or before 2 April 2020 by the Embassies, Consulates-General and Consulate of Japan in Afghanistan, Algeria, Angola, Antigua and Barbuda, Argentina, Azerbaijan, Bahamas, Bangladesh, Barbados, Belarus, Belize, Benin, Bhutan, Botswana, Burkina Faso, Burundi, Cambodia, Cameroon, Cape Verde, Central African Rep., Chad, Colombia, Comoros, Congo, Cook Isl., Costa Rica, Cuba, Djibouti, Dominican Rep., El Salvador, Equatorial Guinea, Eritrea, Eswatini (Swaziland), Ethiopia, Fiji, Gabon, Gambia, Georgia, Ghana, Grenada, Guatemala, Guinea, Guinea-Bissau, Guyana, Haiti, Honduras, India, Iraq, Jamaica, Jordan, Kazakhstan, Kenya, Kiribati, Kyrgyzstan, Kuwait, Lao People&#8217;s Dem. Rep., Lebanon, Lesotho, Liberia, Libya, Madagascar, Malawi, Maldives, Mali, Marshall Isl., Mauritania, Mexico, Micronesia (Federated States), Mongolia, Mozambique, Myanmar, Namibia, Nauru, Nepal, Nicaragua, Niger, Nigeria, Niue, Oman, Pakistan, Palau, Palestinian Territory, Papua New Guinea, Paraguay, Peru, Russian Fed., Rwanda, Samoa, Sao Tome and Principe, Saudi Arabia, Senegal, Seychelles , Sierra Leone, Solomon Isl., Somalia, South Africa, South Sudan, Sri Lanka, St. Kitts and Nevis, St. Lucia, St. Vincent and the Grenadines, Sudan, Suriname, Syria, Tajikistan, Tanzania, Timor-Leste, Togo, Tonga, Trinidad and Tobago, Tunisia, Turkmenistan, Tuvalu, Uganda, Ukraine, United Arab Emirates, Uruguay, Uzbekistan, Vanuatu, Venezuela, Yemen, Zambia or Zimbabwe are invalidated.<br \/>\n14. Passengers transiting through Tokyo (NRT) must transit on the same calendar day.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Jordan<\/strong><\/p>\n<p>Published 29.06.2020<\/p>\n<p>Flights to Jordan are suspended until 14 July 2020.<br \/>\n&#8211; This does not apply to humanitarian, medevac and repatriation flights.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Jamaica<\/strong><\/p>\n<p>Published 11.06.2020<\/p>\n<ol>\n<li>Passengers are not allowed to enter Jamaica.<\/li>\n<\/ol>\n<p>&#8211; This does not apply to passengers with a Travel Authorization document issued by the government of Jamaica.<\/p>\n<p>&#8211; This does not apply to nationals of Jamaica.<\/p>\n<p>&#8211; This does not apply to family members of nationals of Jamaica if traveling together.<\/p>\n<ol start=\"2\">\n<li>Passengers are subject to quarantine for 14 days.<\/li>\n<\/ol>\n<p>Effective 15 June 2020:<\/p>\n<p>Passengers are subject to medical screening.<\/p>\n<p><strong>Kazakhstan<\/strong><\/p>\n<p>Published 06.05.2020<br \/>\nAirports are closed for international flights.<br \/>\n&#8211; This does not apply to state, ferry, sanitary flights and technical landings for refuel.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Korea (Rep.)<\/strong><\/p>\n<p>Published 01.07.2020<\/p>\n<p>1. Short-term visas (type C-1 and C-3) issued on or before 5 April are no longer valid.<br \/>\n2. Visa exemptions for 90 nationalities with a normal passport are temporarily suspended.<br \/>\n&#8211; This does not apply to airline crew.<br \/>\n&#8211; This does not apply to passengers with an APEC Business Travel Card.<br \/>\n3. Korean visas issued by the Wuhan Consulate in the Hubei Province are no longer valid.<br \/>\n4. Visitors who have been in the Hubei Province (China People&#8217;s Rep.) in the past 14 days are not allowed to transit or enter Korea (Rep.).<br \/>\n5. Nationals of China (People’s Rep.) with a passport issued in the Hubei Province are not allowed to transit or enter Korea (Rep.).<br \/>\n6. Passengers arriving from China (People&#8217;s Rep) must have a visa issued by Korea (Rep.) to transit through Korea (Rep.).<br \/>\n&#8211; This does not apply to nationals of Albania, Andorra, Barbados, Dominica, Guyana, Ireland (Rep.), Korea (Rep.), Malta, Mexico, Monaco, Nicaragua, Palau, San Marino, Slovenia, St. Kitts and Nevis, St. Vincent and the Grenadines, USA, Vatican City (Holy See) and Venezuela.<br \/>\n&#8211; This does not apply to passengers with a British passport.<br \/>\n&#8211; This does not apply to passengers with a diplomatic, consular, official, service or special passport.<br \/>\n7. Passengers are subject to quarantine for 14 days and to a PCR test for Coronavirus (COVID-19).<br \/>\n&#8211; This does not apply to nationals of China (People&#8217;s Rep.) traveling on business under the Fast Lane program and their accompanying family members. They must:<br \/>\n&#8211; self-monitor their health conditions minimum 14 days before departure and hold a medical certificate to prove Coronavirus (COVID-19) negative testing result issued at most 72 hours before departure, and<br \/>\n&#8211; be tested on Coronavirus (COVID-19) upon arrival. They must stay at designated quarantine facilities for 1 or 2 days until a negative test result is obtained.<br \/>\n8. Nationals and residents of Korea (Rep.) are required to install &#8216;Self-quarantine safety protection mobile app&#8217;.<br \/>\n9. Passengers and airline crew must install &#8216;Self-diagnosis Mobile App&#8217; in their personal device and a completed Health Declaration Form and a Special Quarantine Declaration Form must be presented to the quarantine desk upon arrival.<br \/>\n10. All flights must arrive at Incheon International Airport (ICN) between 5:00 and 20:00.<br \/>\n11. Passengers with a Re-Entry Permit issued by Korea (Rep.) who left Korea (Rep.) after 1 June 2020 must have a medical certificate.<br \/>\nThe certificate must:<br \/>\n&#8211; be issued by a local authorized medical institute at most 48 hours before departure; and<br \/>\n&#8211; be written in English or Korean; and<br \/>\n&#8211; include the date of examination, and the presence or absence of fever, cough, chills, headache, difficulty of breathing, muscle pain and pulmonary symptoms; and<br \/>\n&#8211; be signed by a medical examiner.<br \/>\n&#8211; This does not apply to passengers with status Diplomats (A-1), Government Officials (A-2, A-3) or Overseas Korean (F-4).<br \/>\n12. Nationals of Mongolia are not allowed to transit if they depart from Mongolia or travel onward to Mongolia.<br \/>\n&#8211; This does not apply to airline crew.<br \/>\n13. Nationals of Russian Fed. are not allowed to transit if they depart from Russian Fed. or travel onward to Russian Fed.<br \/>\n&#8211; This does not apply to airline crew.<br \/>\n14. Nationals of Thailand are not allowed to transit if they depart from Thailand or travel onward to Thailand.<br \/>\n&#8211; This does not apply to airline crew.<br \/>\n15. Passengers with a visa on an expired passport must present a printed &#8220;Visa Grant Notice&#8221; and the expired passport to the immigration upon arrival.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Kosovo (Rep.)<\/strong><\/p>\n<p>Published 25.03.2020<br \/>\n1. Passengers are not allowed to enter Kosovo (Rep.).<br \/>\n&#8211; This does not apply to nationals of Kosovo (Rep.),<br \/>\n&#8211; This does not apply to diplomats accredited to Kosovo (Rep.).<br \/>\n&#8211; This does not apply to representatives of the NATO-Kosovo Force (KFOR) and the European Union Rule of Law Mission in Kosovo (EULEX).<br \/>\n2. Passengers allowed to enter Kosovo (Rep.) are subject to mandatory quarantine for 14 days.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Korea (Dem. People&#8217;s Rep.)<\/strong><\/p>\n<p>Published 06.02.2020<br \/>\n1. Passengers traveling as tourists are not allowed to enter.<br \/>\n2. Passengers traveling on business or duty must spend 14 days in quarantine upon arrival.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Kenya<\/strong><\/p>\n<p>Published 13.05.2020<\/p>\n<ol>\n<li>Flights to Kenya are suspended.<\/li>\n<\/ol>\n<p>&#8211; This does not apply to:<\/p>\n<p>&#8211; aircraft in state of emergency;<\/p>\n<p>&#8211; operations related to humanitarian aid, evacuation, medevac, repatriation and diplomatic flights approved by appropriate authorities.<\/p>\n<ol start=\"2\">\n<li>Flights exempted from the suspension must express their intention in writing to KCAA before departure.<\/li>\n<li>Airline crew are required to self isolate at the designated airport hotels for the duration of their rest period.<\/li>\n<li>Approved flights must provide a completed passengers declaration forms and manifests to Port Health, Immigration and customs.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<p><strong>Kyrgyzstan<\/strong><\/p>\n<p>Published 20.03.2020<br \/>\nFlights to Kyrgyzstan are suspended.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Kuwait<\/strong><\/p>\n<p>Published 08.05.2020<br \/>\n1. Passengers are not allowed to enter Kuwait.<br \/>\n&#8211; This does not apply to nationals of Kuwait and their first degree relatives. They must have a OK TO TRAVEL authorization obtained from the state of Kuwait embassy.<br \/>\n&#8211; This does not apply to domestic workers if accompanied by a national of Kuwait. They must have a OK TO TRAVEL authorization obtained from the state of Kuwait embassy.<br \/>\n&#8211; This does not apply to diplomatic passport holders, UN passport holders, members of UNESCO with prior approval from the government authorities.<br \/>\n2. Passengers must install &#8216;Shlonik&#8217; in their personal device before departure. Airlines must inform Kuwait DGCA of passengers who are not able to install it. Such passengers must present their boarding pass upon arrival.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Lebanon<\/strong><\/p>\n<p>Published 12.04.2020<br \/>\nFlights to Lebanon are suspended.<br \/>\n&#8211; This does not apply to:<br \/>\n&#8211; diplomatic delegations working in Lebanon;<br \/>\n&#8211; international organizations personnel;<br \/>\n&#8211; military;<br \/>\n&#8211; search and rescue, state aircraft and emergency medical flights;<br \/>\n&#8211; United Nations Interim Force in Lebanon (UNIFIL) personnel associated with drilling operations in Block No. 4.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Lesotho<\/strong><\/p>\n<p>Published 29.04.2020<\/p>\n<p>Passengers will be tested for Coronavirus (COVID-19) and placed in quarantine for 14 days.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Libya<\/strong><\/p>\n<p>Latest Updates currently under review.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Latvia<\/strong><\/p>\n<p>Published 03.06.2020<br \/>\n1. Passengers are not allowed to enter and transit Latvia.<br \/>\n&#8211; This does not apply to nationals and residents of Estonia, Latvia and Lithuania.<br \/>\n&#8211; This does not apply to nationals and residents of Switzerland and an EEA Member State traveling from Switzerland or an EEA Member State.<br \/>\n2. Passengers who have been in other countries than Estonia and Lithuania in the past 14 days are subject to self-isolation at their place of residence for 14 days.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Lao People&#8217;s Dem. Rep.<\/strong><\/p>\n<p>Published 10.06.2020<br \/>\nFlights to Lao People&#8217;s Dem. Rep. are suspended.<br \/>\n&#8211; This does not apply to humanitarian, medevac and repatriation flights.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Liberia<\/strong><\/p>\n<p>Published 24.04.2020<\/p>\n<p>Flights to Liberia are suspended.<\/p>\n<p>&#8211; This does not apply to aircraft in state of emergency, technical landing.<\/p>\n<p>&#8211; This does not apply to humanitarian, medevac, Red Cross, repatriation, charter and special flights.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Luxembourg<\/strong><\/p>\n<p>Published 21.03.2020<br \/>\nPassengers are not allowed to enter Luxembourg.<br \/>\n&#8211; This does not apply to nationals of Luxembourg and their family members in order to return home.<br \/>\n&#8211; This does not apply to nationals of the European Union, Schengen Member States and the Schengen Associated States, passengers from the United Kingdom, and their family members in order to return home.<br \/>\n&#8211; This does not apply to passengers who have a long-term resident status in accordance with the European Directive 2003\/109\/EC relating to long-term residents, as well as any other person who have a right of residence in accordance with European directives as well as national law in Grand Duchy of Luxembourg or one of the neighboring countries.<br \/>\n&#8211; This does not apply to healthcare professionals, health researchers and healthcare professionals to the elderly.<br \/>\n&#8211; This does not apply to cross-border workers.<br \/>\n&#8211; This does not apply to members of the diplomatic corps, personnel of international organizations, the military, personnel of the development cooperation and humanitarian aid, during the exercise of their respective functions.<br \/>\n&#8211; This does not apply to passenger travelling by land to their country of origin. They must have a proof of onward journey.<br \/>\n&#8211; This does not apply to passengers traveling for urgent and duly justified family reasons.<br \/>\n&#8211; This does not apply to passengers who want to apply for international protection or subsidiary protection in the Grand Duchy of Luxembourg or for other humanitarian reasons.<\/p>\n<p>&nbsp;<\/p>\n<div class=\"svgMap-tooltip-title\"><strong>Lithuania<\/strong><\/div>\n<div><\/div>\n<div class=\"svgMap-tooltip-content\">\n<div>Published 26.06.2020<br \/>\n1. Passengers are not allowed to enter.<br \/>\n-This does not apply to:<br \/>\n&#8211; nationals and residents of Lithuania;<br \/>\n&#8211; nationals of EEA Member States and Switzerland, if arriving from Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Luxembourg, Malta, Netherlands, Norway, Poland, Romania, Slovakia, Slovenia, Spain or Switzerland;<br \/>\n&#8211; British nationals if arriving from Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Luxembourg, Malta, Netherlands, Norway, Poland, Romania, Slovakia, Slovenia, Spain or Switzerland;<br \/>\n&#8211; residents of EEA Member States, Switzerland and United Kingdom, if arriving from Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Luxembourg, Malta, Netherlands, Norway, Poland, Romania, Slovakia, Slovenia, Spain or Switzerland;<br \/>\n&#8211; family members of nationals of Lithuania;<br \/>\n&#8211; family members of permanent residents of Lithuania;<br \/>\n&#8211; NATO personnel and personnel working for them and their family members.<br \/>\n2. Passengers must arrive at Vilnius (VNO), Kaunas (KUN), Palanga (PLQ) or Siauliai (SQQ).<br \/>\n3. Transit through Lithuania is possible only for passengers traveling in groups on their way back to their country of residence. They must be escorted to the international border crossing points.<br \/>\n4. Nationals and residents of Lithuania arriving from Belgium, Ireland (Rep.), Portugal, Sweden or United Kingdom are subject to quarantine for 14 days.<br \/>\n5. Passengers arriving from Belgium or Ireland (Rep.) are subject to quarantine for 14 days<\/div>\n<\/div>\n<p>&nbsp;<\/p>\n<p><strong>Malta<\/strong><\/p>\n<p>Published 14.04.2020<\/p>\n<ol>\n<li>Flights to Malta are suspended.<\/li>\n<\/ol>\n<p>&#8211; This does not apply to ferry flights, humanitarian flights and repatriation flights.<\/p>\n<ol start=\"2\">\n<li>Passengers and airline crew must self-quarantine for 14 days.<\/li>\n<li>A completed Public Health Passenger Locator Form must be presented to a handling agent upon arrival.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<p><strong>Madagascar<\/strong><\/p>\n<p>Published 20.04.2020<\/p>\n<p>All flights to Madagascar are suspended.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Malawi<\/strong><\/p>\n<p>Published 28.04.2020<\/p>\n<ol>\n<li>Passengers are not allowed to enter Malawi.<\/li>\n<\/ol>\n<p>&#8211; This does not apply to nationals of Malawi.<\/p>\n<p>&#8211; This does not apply to passengers who reside in Malawi.<\/p>\n<ol start=\"2\">\n<li>Nationals and residents of Malawi are required to self-isolate. They will be monitored by health personnel.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<p><strong>Mauritius<\/strong><\/p>\n<p>Published 07.05.2020<\/p>\n<ol>\n<li>Passengers are not allowed to transit or enter Mauritius.<\/li>\n<\/ol>\n<p>&#8211; This does not apply to nationals or residents of Mauritius, their spouses and children. They will be placed in quarantine.<\/p>\n<ol start=\"2\">\n<li>Airline crew must stay in their hotel rooms.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<p><strong>Mali<\/strong><\/p>\n<p>Published 04.05.2020<\/p>\n<p>Flights to Mali are suspended.<\/p>\n<p>&#8211; This does not apply to humanitarian flights.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Macedonia<\/strong><\/p>\n<p>Published 22.03.2020<br \/>\nNorth Macedonia (Rep.) borders are closed.<br \/>\n&#8211; This does not apply to nationals and residents of North Macedonia (Rep.).<br \/>\n&#8211; This does not apply to accredited diplomats.<br \/>\n&#8211; This does not apply to passengers with a special permit issued by the Ministry of Interior of North Macedonia (Rep.).<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Montserrat<\/strong><\/p>\n<p>Published 27.03.2020<\/p>\n<p>Passengers are not allowed to enter Montserrat.<\/p>\n<p>&#8211; This does not apply to passengers from Montserrat.<\/p>\n<p>&#8211; This does not apply to passengers who have a permit of permanent residence.<\/p>\n<p>&#8211; This does not apply to husband, wife, child or other dependents of a person who is from or resides in Montserrat.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Mauritania<\/strong><\/p>\n<p>Published 26.03.2020<\/p>\n<p>All airports in Mauritania are closed.<\/p>\n<p><strong>Mexico<\/strong><\/p>\n<p>Published 12.05.2020<\/p>\n<p>No regulations related to Coronavirus (COVID-19) implemented.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Morocco<\/strong><\/p>\n<p>Published 26.05.2020<\/p>\n<p>Flights to Morocco are suspended.<\/p>\n<p>&#8211; This does not apply to VIP flights with an authorization issued by the Ministry of Foreign Affairs of Morocco.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Martinique<\/strong><\/p>\n<p>Latest Updates currently under review.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Malaysia<\/strong><\/p>\n<p>Published 10.06.2020<br \/>\n1. Passengers are not allowed to enter Malaysia.<br \/>\n&#8211; This does not apply to nationals of Malaysia.<br \/>\n&#8211; This does not apply to permanent residents of Malaysia with a MyPR card.<br \/>\n&#8211; This does not apply to passengers with a Malaysia My Second Home (MM2H). They must have a Coronavirus (COVID-19) negative testing result issued before departure and an Immigration approval.<br \/>\n&#8211; This does not apply to spouses or children of nationals of Malaysia. They must have a sticker label visa in the passport specifically indicating they are either spouses or children.<br \/>\n&#8211; This does not apply to passengers with a diplomatic passport.<br \/>\n&#8211; This does not apply to passengers with official passport on a diplomatic mission.<br \/>\n2. Passengers who are allowed to enter are subject to self-quarantine for 14 days.<br \/>\n3. Transfer from an international flight to a domestic flight is not allowed.<br \/>\n&#8211; This does not apply to nationals of Malaysia traveling to Sabah or Sarawak.<br \/>\n4. Airline crew are subject to health screening upon arrival.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Mongolia<\/strong><\/p>\n<p>Published 06.05.2020<br \/>\n1. Passengers are not allowed to enter Mongolia.<br \/>\n&#8211; This does not apply to nationals of Mongolia.<br \/>\n&#8211; This does not apply to residents of Mongolia who are direct family members of a national of Mongolia.<br \/>\n&#8211; This does not apply to accredited staff and their direct family members of diplomatic missions and offices of international organizations in Mongolia.<br \/>\n&#8211; This does not apply to international freight transport drivers and railway train personnel of Mongolia, Russian Fed. and China (People’s Rep.).<br \/>\n2. Nationals of Mongolia will be placed in quarantine for 21 days at designated facilities upon arrival. After the quarantine period ends, they shall be under self-isolation at home for 14 days.<br \/>\n3. Residents of Mongolia who are direct family members of a national of Mongolia will be placed in quarantine for 21 days at designated facilities upon arrival. After the quarantine period ends, they shall be under self-isolation at home for 14 days.<br \/>\n4. Accredited staff and their direct family members of diplomatic missions and offices of international organizations in Mongolia will be quarantined for 21 days at designated facilities upon arrival. After the quarantine period ends, they shall be under self-isolation at home for 14 days.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Mozambique<\/strong><\/p>\n<p>Published 04.06.2020<\/p>\n<ol>\n<li>Passengers arriving from countries with cases of Coronavirus (COVID-19) or who have been in contact with infected persons are subject to quarantine for 14 days.<\/li>\n<li>Airline crew who disembark are subject to quarantine during their rotation\/rest period of maximum of 24 hours.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<p><strong>Moldova (Rep.)<\/strong><\/p>\n<p>Published 16.03.2020<br \/>\nPassengers are not allowed to enter Moldova (Rep.).<br \/>\n&#8211; This does not apply to nationals and residents of Moldova (Rep.).<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Montenegro<\/strong><\/p>\n<p>Published 08.06.2020<br \/>\n1. Passengers are not allowed to enter Montenegro.<br \/>\n&#8211; This does not apply to nationals of Montenegro.<br \/>\n&#8211; This does not apply to passengers who reside in Montenegro.<br \/>\n&#8211; This does not apply to passengers arriving from Albania, Algeria, Angola, Antigua and Barbuda, Australia, Austria, Bahamas, Barbados, Belize, Benin, Bhutan, Bosnia and Herzegovina, Botswana, Brunei Darussalam, Bulgaria, Burkina Faso, Burundi, Cambodia, Cameroon, Chad, China (People&#8217;s Rep.), Comoros, Congo, Congo (Dem. Rep.), Costa Rica, Cote d&#8217;Ivoire, Croatia, Cuba, Cyprus, Czechia, Denmark, Dominica, Egypt, El Salvador, Eritrea, Estonia, Eswatini, Ethiopia, Fiji, Finland, Gambia, Georgia, Germany, Ghana, Greece, Guinea, Guyana, Haiti, Hungary, Iceland, India, Indonesia, Iraq, Ireland (Rep.), Israel, Jamaica, Japan, Jordan, Kenya, Korea (Rep.), Kosovo (Rep.), Kyrgyzstan, Lao People&#8217;s Dem. Rep., Latvia, Lebanon, Lesotho, Liberia, Libya, Lithuania, Luxembourg, Madagascar, Malawi, Malaysia, Mali, Malta, Mauritania, Mauritius, Mexico, Monaco, Mongolia, Morocco, Mozambique, Myanmar, Namibia, Nepal, New Zealand, Nicaragua, Niger, Nigeria, Norway, Palestinian Territory, Papua New Guinea, Paraguay, Philippines, Rwanda, Senegal, Seychelles, Sierra Leone, Slovakia, Slovenia, Somalia, South Sudan, Sri Lanka, St. Kitts and Nevis, St. Lucia, St. Vincent and the Grenadines, Sudan, Suriname, Switzerland, Syria, Tajikistan, Tanzania, Thailand, Timor-Leste, Togo, Trinidad and Tobago, Tunisia, Uganda, Uruguay, Uzbekistan, Venezuela, Viet Nam, Yemen, Zambia or Zimbabwe.<br \/>\n2. Nationals and residents of Montenegro are subject to self-isolate for 14 days.<br \/>\n&#8211; This does not apply if arriving from Albania, Algeria, Angola, Antigua and Barbuda, Australia, Austria, Bahamas, Barbados, Belize, Benin, Bhutan, Bosnia and Herzegovina, Botswana, Brunei Darussalam, Bulgaria, Burkina Faso, Burundi, Cambodia, Cameroon, Chad, China (People&#8217;s Rep.), Comoros, Congo, Congo (Dem. Rep.), Costa Rica, Cote d&#8217;Ivoire, Croatia, Cuba, Cyprus, Czechia, Denmark, Dominica, Egypt, El Salvador, Eritrea, Estonia, Eswatini, Ethiopia, Fiji, Finland, Gambia, Georgia, Germany, Ghana, Greece, Guinea, Guyana, Haiti, Hungary, Iceland, India, Indonesia, Iraq, Ireland (Rep.), Israel, Jamaica, Japan, Jordan, Kenya, Korea (Rep.), Kosovo (Rep.), Kyrgyzstan, Lao People&#8217;s Dem. Rep., Latvia, Lebanon, Lesotho, Liberia, Libya, Lithuania, Luxembourg, Madagascar, Malawi, Malaysia, Mali, Malta, Mauritania, Mauritius, Mexico, Monaco, Mongolia, Morocco, Mozambique, Myanmar, Namibia, Nepal, New Zealand, Nicaragua, Niger, Nigeria, Norway, Palestinian Territory, Papua New Guinea, Paraguay, Philippines, Rwanda, Senegal, Seychelles, Sierra Leone, Slovakia, Slovenia, Somalia, South Sudan, Sri Lanka, St. Kitts and Nevis, St. Lucia, St. Vincent and the Grenadines, Sudan, Suriname, Switzerland, Syria, Tajikistan, Tanzania, Thailand, Timor-Leste, Togo, Trinidad and Tobago, Tunisia, Uganda, Uruguay, Uzbekistan, Venezuela, Viet Nam, Yemen, Zambia or Zimbabwe.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Myanmar<\/strong><\/p>\n<p>Published 12.06.2020<br \/>\n1. Visa issuance is suspended.<br \/>\n2. Flights to Myanmar are suspended.<br \/>\n&#8211; This does not apply to relief flights.<br \/>\n&#8211; This does not apply to medical evacuation flights.<br \/>\n&#8211; This does not apply to special flights approved by the Department of Civil Aviation.<br \/>\n3. Airline crew are subject to quarantine until their next departure flight.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Namibia<\/strong><\/p>\n<p>Published 21.04.2020<\/p>\n<p>Namibia&#8217;s borders are closed.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Nigeria<\/strong><\/p>\n<p>Published 11.06.2020<\/p>\n<ol>\n<li>Flights to Nigeria are suspended.<\/li>\n<\/ol>\n<p>&#8211; This does not apply to emergency and essential flights.<\/p>\n<ol start=\"2\">\n<li>Nationals and residents of Nigeria are subject to quarantine for 14 days.<\/li>\n<li>Nationals and residents of Nigeria must:<\/li>\n<\/ol>\n<p>&#8211; present a completed “Health Declaration Form&#8221; upon arrival, and<\/p>\n<p>&#8211; have a medical certificate with a negative Coronavirus (COVID-19) test result issued at most 5 days before arrival.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>New Zealand<\/strong><\/p>\n<p>&nbsp;<\/p>\n<p>Published 11.06.2020<br \/>\n1. Passengers are not allowed to enter.<br \/>\n&#8211; This does not apply to nationals of New Zealand (including Cook Isl., Niue, Tokelau).<br \/>\n&#8211; This does not apply to the immediate family members of nationals of New Zealand.<br \/>\n&#8211; This does not apply to passengers with a permanent resident visa and their immediate family members.<br \/>\n&#8211; This does not apply to accredited diplomats residing in New Zealand.<br \/>\n&#8211; This does not apply to nationals of Australia ordinarily resident in New Zealand.<br \/>\n2. Passengers are not allowed to transit.<br \/>\n&#8211; This does not apply to nationals and residents of New Zealand and their immediate family members, if they are residing in Australia and transiting through New Zealand to return to Australia.<br \/>\n&#8211; This does not apply to nationals and residents of Australia and their immediate family members, if they are transiting through New Zealand to return to Australia.<br \/>\n&#8211; This does not apply to nationals and residents of Chile or Fiji and their immediate family members, if they are transiting through New Zealand to return to Chile.<br \/>\n&#8211; This does not apply to nationals and residents of Argentina, Austria, Belgium, Brazil, Bulgaria, Canada, China (People&#8217;s Rep.), Croatia, Czechia, Denmark, Ecuador, Finland, France, Germany, Italy, Japan, Korea (Rep.), Malaysia, Mexico, Netherlands, North Macedonia (Rep.), Norway, Papua New Guinea, Philippines, Poland, Qatar, Singapore, Slovakia, Slovenia, Solomon Isl., South Africa, Spain, Sweden, Switzerland, United Kingdom, USA , Uruguay and their immediate family members, if they are transiting through New Zealand to return directly to one of the above countries.<br \/>\n&#8211; This does not apply to nationals and residents of Argentina, Austria, Belgium, Brazil, Bulgaria, Canada, China (People&#8217;s Rep.), Croatia, Czechia, Denmark, Ecuador, Finland, France, Germany, Italy, Japan, Korea (Rep.), Malaysia, Mexico, Netherlands, North Macedonia (Rep.), Norway, Papua New Guinea, Philippines, Poland, Qatar, Singapore, Slovakia, Slovenia, Solomon Isl., South Africa, Spain, Sweden, Switzerland, United Kingdom, USA, Uruguay and their immediate family members, if they are transiting through New Zealand to first reach Canada, Japan, Korea (Rep.), Malaysia, Qatar or USA, in order to return to one of the above countries.<br \/>\n3. Passengers are subject to medical screening and quarantine for 14 days.<br \/>\n&#8211; This does not apply to passengers in transit.<br \/>\n4. Airline crew must use appropriate personal protective equipment (PPE). They are not subject to quarantine.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Nepal<\/strong><\/p>\n<p>Published 06.05.2020<br \/>\nInternational flights to Nepal are suspended.<br \/>\n&#8211; This does not apply to evacuation, rescue and emergency flights with a special permission from Civil Aviation Authority of Nepal.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>New Caledonia<\/strong><\/p>\n<p>Published 01.04.2020<br \/>\nFlights to New Caledonia are suspended.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Nicaragua<\/strong><\/p>\n<p>Published 01.05.2020<\/p>\n<p>Airports in Nicaragua are closed.<\/p>\n<p>&#8211; This does not apply to humanitarian flights with a flight authorization requested 72 hours prior to flight. The passenger manifest must be submitted with the request<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Norway<\/strong><\/p>\n<div class=\"svgMap-tooltip-content\">Published 14.07.2020<\/div>\n<div class=\"svgMap-tooltip-content\">1. Passengers are not allowed to enter until 20 August 2020.<br \/>\n-This does not apply to:<br \/>\n&#8211; nationals and residents of Norway;<br \/>\n&#8211; passengers arriving from Denmark, Finland, Iceland;<br \/>\n&#8211; nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland and British nationals residing in Norway. If they cannot prove their residency in Norway, they must be able to prove their nationality in one of the countries listed above;<br \/>\n&#8211; family members of nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland and British nationals, if they are already residing in Norway or are moving to Norway;<br \/>\n&#8211; nationals of Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Poland, Portugal, Romania, San Marino, Slovakia, Slovenia, Spain, Sweden, Switzerland, Vatican City (Holy See) and British nationals returning via Norway to their country of residence;<br \/>\n&#8211; passengers with a visa issued by Norway after 15 March 2020;<br \/>\n&#8211; visa exempt nationals who have been granted a residence permit, but have not yet received the residence card (a letter from UDI with the approval of the residence permit will document that the permit has been granted). This also goes for family members of EEA citizens who have been granted a residence card, but the card has not been issued yet;<br \/>\n&#8211; passengers with a &#8220;D&#8221; visa issued by Norway;<br \/>\n&#8211; spouses, partners and children of passengers with a diplomatic passport issued by Norway;<br \/>\n&#8211; passengers with an ID card as diplomat or a Schengen residence card issued to diplomatic staff;<br \/>\n&#8211; NATO staff with travel order;<br \/>\n&#8211; seamen in transit to ships;<br \/>\n&#8211; effective 15 July 2020, passengers arriving from Austria, Belgium, Cyprus, Czechia, Estonia, France, Germany, Greece, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Malta, Netherlands, Poland, Slovakia, Slovenia, Spain, Sweden (only Blekinge, Kronoberg and Skane), Switzerland and United Kingdom.<br \/>\n2. Passengers are subject to quarantine for 10 days.<\/div>\n<p>&nbsp;<\/p>\n<p><strong>Netherlands<\/strong><\/p>\n<div class=\"svgMap-tooltip-title\"><\/div>\n<div class=\"svgMap-tooltip-content\">\n<div>Published 06.07.2020<\/div>\n<div>1. Passengers are not allowed to enter.<br \/>\n-This does not apply to:<br \/>\n&#8211; nationals of the Netherlands;<br \/>\n&#8211; nationals of Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Montenegro, North Macedonia (Rep.), Norway, Poland, Portugal, Romania, San Marino, Serbia, Slovakia, Slovenia, Spain, Sweden, Switzerland and Vatican City (Holy See), returning via Netherlands to their country of residence;<br \/>\n&#8211; British nationals returning via Netherlands to their country of residence;<br \/>\n&#8211; passengers arriving from Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Lithuania, Liechtenstein, Luxembourg, Malta, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or the United Kingdom;<br \/>\n&#8211; passengers with a residence permit issued by the Netherlands;<br \/>\n&#8211; passengers with a long-term residence permit issued by Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Ireland (Rep.), Italy, Latvia, Lithuania, Luxembourg, Malta, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden or the United Kingdom;<br \/>\n&#8211; family members of a national of an EEA Member State or Switzerland, with a residence permit issued by Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or the United Kingdom, to family members of a Union Citizen;<br \/>\n&#8211; passengers with a long-term &#8220;D&#8221; visa issued by Austria, Belgium, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Slovakia, Slovenia, Spain, Sweden or Switzerland;<br \/>\n&#8211; residents of Algeria, Australia, Canada, Georgia, Japan, Korea (Rep.), Montenegro, Morocco, New Zealand, Rwanda, Serbia, Thailand, Tunisia and Uruguay;<br \/>\n&#8211; military personnel.<br \/>\n2. A completed &#8216;Health Declaration Form&#8217; for passengers departing from high risk Coronavirus (COVID-19) countries must be presented prior to boarding.<br \/>\n3. Passengers departing from high risk Coronavirus (COVID-19) countries are subject to self-quarantine for 14 days.<\/div>\n<\/div>\n<p>&nbsp;<\/p>\n<p><strong>Oman<\/strong><\/p>\n<p>Published 07.05.2020<br \/>\nPassengers are not allowed to enter Oman.<br \/>\n&#8211; This does not apply to nationals of Oman.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Palestinian Territory<\/strong><\/p>\n<p>Latest Updates currently under review.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Puerto Rico<\/strong><\/p>\n<p>Published 06.04.2020<\/p>\n<ol>\n<li>Passengers will be quarantined for 14 days.<\/li>\n<li>Passengers must present a completed Puerto Rico Department of Health form upon arrival.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<p><strong>Pakistan<\/strong><\/p>\n<p>Published 13.05.2020<br \/>\n1. Flights to Pakistan are suspended.<br \/>\n&#8211; This does not apply to diplomatic, special and flights of national carriers. They must have a special approval from the competent authority for transporting stranded passengers.<br \/>\n2. A completed International Passenger Health Declaration Form must be presented upon arrival.<br \/>\n3. Passengers and airline crew are subject to health screening (including swab testing, isolation or quarantine).<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Paraguay<\/strong><\/p>\n<p>Published 17.04.2020<\/p>\n<p>Flights to Paraguay are suspended.<\/p>\n<p>&#8211; This does not apply to health services and repatriation flights.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Panama<\/strong><\/p>\n<p>Published 21.04.2020<\/p>\n<p>Flights to Panama are suspended.<\/p>\n<p>&#8211; This does not apply to humanitarian flights.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Peru<\/strong><\/p>\n<p>Published 14.04.2020<\/p>\n<ol>\n<li>Passengers are not allowed to enter Peru.<\/li>\n<li>Airline crew must self-isolate at hotel Costa del Sol at Jorge Chavez International Airport for the entire duration of stay.<\/li>\n<\/ol>\n<p><strong> <\/strong><\/p>\n<p><strong>Papua New Guinea<\/strong><\/p>\n<p>Published 28.05.2020<br \/>\n1. Passengers can only land at Port Moresby (POM).<br \/>\n2. Passengers who reside in Papua New Guinea must depart from Brisbane (BNS), Cairns (CNS) or Singapore.<br \/>\n3. Passengers must be quarantined for 14 days at designated hotels in Port Moresby.<br \/>\n4. Passengers and airline crew must obtain State of Emergency (SOE) controller approval to enter.<\/p>\n<p><strong> <\/strong><\/p>\n<p><strong>Philippines<\/strong><\/p>\n<p>Published 11.06.2020<br \/>\n1. Passengers are not allowed to enter Philippines.<br \/>\n&#8211; This does not apply to nationals of Philippines.<br \/>\n&#8211; This does not apply to spouses or children of nationals of the Philippines.<br \/>\n&#8211; This does not apply to accredited diplomats or officials of international organizations.<br \/>\n2. Commercial flights to Philippines can only land on Tuesday, Wednesday, Friday, Saturday or Sunday with an approval from CAAP 48h before departure.<br \/>\n3. Chartered flights to Philippines can only land on Monday or Thursday with a secured clearance from the Department of Foreign Affairs and CAAP.<br \/>\n4. Passengers are subject to a Coronavirus (COVID-19) test and quarantine.<br \/>\n5. Airline crew are subject to self-quarantine until they leave the country.<br \/>\n6. A completed Case Investigation Form must be presented upon arrival.<\/p>\n<p><strong> <\/strong><\/p>\n<p><strong>Poland<\/strong><\/p>\n<p>Borders for international tourists likely to be open from June 13.<\/p>\n<p>1. Flights to Poland are suspended.<br \/>\n&#8211; This does not apply to humanitarian, medevac and repatriation flights.<br \/>\n2. Passengers are subject to quarantine for 14 days.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Portugal<\/strong><\/p>\n<p>Published 08.07.2020<\/p>\n<p>1. Passengers are not allowed to enter.<br \/>\n&#8211; This does not apply to:<br \/>\n&#8211; nationals and residents of Portugal;<br \/>\n&#8211; passengers with a long term visa issued by Portugal;<br \/>\n&#8211; passengers arriving from Algeria, Austria, Belgium, Bulgaria, Canada, China (People&#8217;s Rep.), Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Korea (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Morocco, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland, Tunisia and United Kingdom;<br \/>\n&#8211; passengers arriving from Angola, Brazil, Cape Verde, Guinea-Bissau, Mozambique, Sao Tome and Principe and USA traveling as students;<br \/>\n&#8211; passengers with a residence permit issued by Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Ireland (Rep.), Italy, Latvia, Lithuania, Luxembourg, Malta, Netherlands, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden or United Kingdom, returning via Portugal to their country of residence;<br \/>\n&#8211; passengers with a long term visa issued by Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Ireland (Rep.), Italy, Latvia, Lithuania, Luxembourg, Malta, Netherlands, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden or United Kingdom, returning via Portugal to their country of residence.<br \/>\n2. Flights to Portugal are suspended.<br \/>\n&#8211; This does not apply to flights arriving from Angola, Austria, Belgium, Brazil (Sao Paulo (GRU) and Rio De Janeiro (RIO)), Bulgaria, Canada, Cape Verde, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Guinea-Bissau, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Lithuania, Luxembourg, Malta, Mozambique, Netherlands, Norway, Poland, Portugal, Romania, Sao Tome and Principe, Slovakia, Slovenia, South Africa, Sweden, Switzerland, USA, United Kingdom or Venezuela.<br \/>\n&#8211; This does not apply to medevac, humanitarian and repatriation flights.<\/p>\n<p>3. Passengers arriving in Azores are subject to medical screening and quarantine.<br \/>\n&#8211; This does not apply to passengers with a certificate with a negative Coronavirus (COVID-19) result issued at most 72 hours before departure.<br \/>\n4. Passengers arriving from Angola, Brazil, Cape Verde, Guinea-Bissau, Mozambique, Sao Tome and Principe and USA must have a medical certificate with a negative Coronavirus (COVID-19) test result issued at most 72 hours before departure.<\/p>\n<p><strong>Qatar<\/strong><\/p>\n<p>Published 19.04.2020<br \/>\n1. Passengers are not allowed to enter Qatar.<br \/>\n&#8211; This does not apply to nationals of Qatar.<br \/>\n&#8211; This does not apply to residents of Qatar with a Permanent Residence card.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Rwanda<\/strong><\/p>\n<p>Published 22.04.2020<\/p>\n<ol>\n<li>Flights to Kigali International Airport (KGL) are suspended.<\/li>\n<li>Nationals and residents of Rwanda will be subject to a mandatory 14-day quarantine at designated locations.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<p><strong>Reunion<\/strong><\/p>\n<p>Published 06.05.2020<\/p>\n<ol>\n<li>A completed International Travel Certificate must be presented prior to boarding and to Immigration upon arrival or when transiting Reunion. The certificate must be obtained before departure via the French consular offices abroad.<\/li>\n<li>Passengers must go through a medical examination upon arrival and are subject to quarantine for a period of 14 days.<\/li>\n<li><\/li>\n<\/ol>\n<p><strong>Romania<\/strong><\/p>\n<div class=\"svgMap-tooltip-title\"><\/div>\n<div class=\"svgMap-tooltip-content\">\n<div>Published 08.07.2020<\/div>\n<div><\/div>\n<div>1. Passengers are not allowed to enter Romania until 17 July 2020.<br \/>\nThis does not apply to:<br \/>\n&#8211; nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden and Switzerland;<br \/>\n&#8211; residents of Romania;<br \/>\n&#8211; British nationals;<br \/>\n&#8211; family members of nationals of Romania;<br \/>\n&#8211; passengers with a long-stay visa issued by Romania;<br \/>\n&#8211; humanitarian, international organizations and military personnel.<br \/>\n2. Flights from French Overseas Territories, Iran, Turkey and USA to Romania are suspended.<br \/>\n&#8211; This does not apply to humanitarian and medevac flights.<br \/>\n3. Passports and national ID cards issued by Romania which have expired during the COVID-19 outbreak, are considered valid until 14 August 2020.<\/div>\n<\/div>\n<p>&nbsp;<\/p>\n<p><strong>Russia<\/strong><\/p>\n<p>Published 26.03.2020<br \/>\nPassengers are not allowed to enter the Russian Fed.<br \/>\n&#8211; This does not apply to nationals of the Russian Fed.;<br \/>\n&#8211; This does not apply to accredited or appointed employees of diplomatic missions, consular offices, international organizations located in Russian Fed. and their family members;<br \/>\n&#8211; This does not apply to members of official delegations;<br \/>\n&#8211; This does not apply to travelers with diplomatic, business or normal visas issued in connection with the death of a close relative, as well as visas issued by special decision of the Russian Ministry of Foreign Affairs;<br \/>\n&#8211; This does not apply to passengers from visa-free countries coming in connection with the death of a close relative, having copies of death certificate, as well as a document confirming family relations;<br \/>\n&#8211; This does not apply to passengers who are family members (spouses, parents, kids, adoptive parents, adopted), guardians and trustees of citizens of the Russian Fed., subject to the presentation of a copy of a document confirming the relationship status;<br \/>\n&#8211; This does not apply to passengers permanently residing in the Russian Fed., as well as transiting through airports without entering the Russian Fed.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>South Africa<\/strong><\/p>\n<p>Published 12.06.2020<\/p>\n<ol>\n<li>Flights to South Africa are suspended.<\/li>\n<\/ol>\n<p>&#8211; This does not apply to repatriation, medevac and emergency flights.<\/p>\n<ol start=\"2\">\n<li>Nationals and residents of South Africa are subject to medical screening and quarantine for 21 days.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<p><strong>Sudan<\/strong><\/p>\n<p>Published 02.06.2020<\/p>\n<p>Flights to Sudan are suspended.<\/p>\n<p>&#8211; This does not apply to humanitarian, medical and repatriation flights.<\/p>\n<p>Eritrea<\/p>\n<p>Published 02.04.2020<\/p>\n<p>Asmara (ASM) is closed.<\/p>\n<p><strong> <\/strong><\/p>\n<p><strong>Senegal<\/strong><\/p>\n<p>Published 16.04.2020<\/p>\n<p>Flights to Senegal are suspended.<\/p>\n<p><strong> <\/strong><\/p>\n<p><strong>Sierra Leone<\/strong><\/p>\n<p>Published 26.03.2020<\/p>\n<ol>\n<li>Passengers who have transited through or have been in any country with 50 or more confirmed cases of Coronavirus (COVID-19) in the past 14 days are required to enter facility quarantine for maximum 14 days.<\/li>\n<li>Passengers who have transited through or have been in any country with less than 50 confirmed cases of Coronavirus (COVID-19) in the past 14 days are required to undergo home quarantine for maximum 14 days.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<p><strong>South Sudan<\/strong><\/p>\n<p>Published 22.04.2020<\/p>\n<p>Flights to South Sudan are suspended.<\/p>\n<p>&#8211; This does not apply to humanitarian and evacuation flights with an approval from the High Level Task Force of South Sudan.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Somalia<\/strong><\/p>\n<p>Published 08.06.2020<\/p>\n<p>Airports in Somalia are closed.<\/p>\n<p>&#8211; This does not apply to medical and humanitarian flights or technical landings where passengers and airline crew do not disembark.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Saudi Arabia<\/strong><\/p>\n<p>Published 19.05.2020<br \/>\nFlights to Saudi Arabia are suspended.<br \/>\n&#8211; This does not apply to technical stops, humanitarian, medevac and repatriation flights. These flights are subject to prior approval from GACA.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Serbia<\/strong><\/p>\n<p>Published 22.05.2020<br \/>\nNo regulations related to Coronavirus (COVID-19) implemented.<\/p>\n<p>Saint Kitts and Nevis<\/p>\n<p>Published 12.04.2020<\/p>\n<p>Airports in St. Kitts and Nevis are closed.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Sint Maarten<\/strong><\/p>\n<p>Published 10.04.2020<\/p>\n<p>Passengers and airline crew are not allowed to enter St. Maarten.<\/p>\n<p>&#8211; This does not apply to passengers who are specialists with evidence of traveling at the invitation of the Government of St. Maarten.<\/p>\n<p>&#8211; This does not apply to emergency and essential flights from Aruba, Curacao, Bonaire, St. Eustatius and Saba.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Sri Lanka<\/strong><\/p>\n<p>Published 08.06.2020<br \/>\n1. Airports in Sri Lanka are closed.<br \/>\n&#8211; This does not apply to:<br \/>\na. Aircraft departures with passengers originating from Colombo, stop overs, transit passengers or visiting tourists.<br \/>\nb. Emergency Diversions to Bandaranaike International Airport (CMB).<br \/>\nc. Freighter Operations and humanitarian flights to CMB.<br \/>\nd. Technical landings at CMB.<br \/>\n2. A completed Health Declaration Form must be presented to the public health inspectors or any other authorized officials upon arrival.<br \/>\n3. Airline crew must self-quarantine at the location mentioned in the Health Declaration Form and have meals only through in-room dining until they operate the next flight. They must follow strict procedures and hygienic measures adopted by the Government of Sri Lanka.<br \/>\n4. Visas and ETAs issued by Sri Lanka have been invalidated.<br \/>\n5. The maximum allowed transit time at CMB is 12 hours. Passengers must have a confirmed onward connection.<br \/>\n6. Passengers and airline crew are subject to a Coronavirus (COVID-19) test and self-quarantine.<br \/>\n&#8211; This does not apply to airline crew who do not disembark the aircraft.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Solomon Islands<\/strong><\/p>\n<p>Published 04.05.2020<br \/>\n1. Passengers and airline crew are not allowed to enter Solomon Isl.<br \/>\n&#8211; This does not apply to nationals and residents of Solomon Isl.<br \/>\n&#8211; This does not apply to passengers with prior written authorization issued by the Prime Minister.<br \/>\n2. Nationals and residents of Solomon Isl. who have been in countries with confirmed cases of Coronavirus (COVID-19) will be put in quarantine for a period of 14 days upon arrival.<br \/>\n3. Passengers with prior written authorization issued by the Prime Minister who have been in countries with confirmed cases of Coronavirus (COVID-19) will be put in quarantine for a period of 14 days upon arrival.<br \/>\n4. Passengers must present a completed Traveler’s Public Health Declaration Card and provide full details of their place of stay, travel itinerary and current personal contact details in<\/p>\n<p>Solomon Isl.<br \/>\n5. Passengers and airline crew must provide details of their international travel history for the period of 14 days prior to arrival in Solomon Isl.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Slovakia<\/strong><\/p>\n<div class=\"svgMap-tooltip-title\"><\/div>\n<div class=\"svgMap-tooltip-content\">\n<div>Published 07.07.2020<\/div>\n<div>1. Passengers are not allowed to enter.<br \/>\n&#8211; This does not apply to passengers arriving from passengers arriving from Australia, Austria, Belgium, Bulgaria, China (People&#8217;s Rep.), Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Japan, Korea (Rep.), Latvia, Liechtenstein, Lithuania, Malta, Monaco, Montenegro, Netherlands, New Zealand, Norway, Poland, Slovenia, Spain or Switzerland.<br \/>\n&#8211; This does not apply to nationals and residents of Slovakia.<br \/>\n2. Passengers arriving from Bulgaria and Montenegro are subject to medical screening and self-isolation.<\/div>\n<\/div>\n<p><strong>Spain<\/strong><\/p>\n<p>Published 07.07.2020<\/p>\n<p>1. Passengers are not allowed to enter until 31 July 2020.<br \/>\nThis does not apply to:<br \/>\n&#8211; nationals and residents of Spain;<br \/>\n&#8211; passengers arriving from Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Sweden, Switzerland or United Kingdom;<br \/>\n&#8211; residents of Andorra, Australia, Austria, Belgium, Bulgaria, Canada, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Georgia, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Japan, Korea (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Montenegro, Netherlands, New Zealand, Norway, Poland, Portugal, Romania, Rwanda, San Marino, Serbia, Slovakia, Slovenia, Spain, Sweden, Thailand, Tunisia, Uruguay or Vatican City (Holy See);<br \/>\n&#8211; passengers with a long-term visa issued by a Schengen Member State;<br \/>\n&#8211; students of EEA Member States and Switzerland with a student card and a long-term &#8220;D&#8221; visa;<br \/>\n&#8211; immediate family members of a national of a EU Member State traveling together or traveling to join the national of a EU Member State;<br \/>\n&#8211; immediate family members of a British national traveling together or traveling to join the British national<br \/>\n2. A completed &#8220;Health Control Form&#8221; must be presented upon arrival.<br \/>\n3. Residency permits and &#8220;D&#8221; visas that expired after 14 December 2019 are accepted for entry. These documents are valid 6 months after the state of alarm has ended.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Suriname<\/strong><\/p>\n<p>Published 09.04.2020<\/p>\n<p>Airports in Suriname are closed.<\/p>\n<p>&#8211; This does not apply to repatriation flights.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Syria<\/strong><\/p>\n<p>Latest Updates currently under review<\/p>\n<p><em> <\/em><\/p>\n<p><strong>Saint Vincent and the Grenadines<\/strong><\/p>\n<p>Published 20.03.2020<\/p>\n<p>Passengers who have been in China (People&#8217;s Rep.), Hong Kong (SAR China), Japan, Korea (Rep.), Macao (SAR China) or Singapore in the past 14 days are not allowed to enter St. Vincent and the Grenadines.<\/p>\n<p>-This does not apply to nationals of St. Vincent and the Grenadines.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Saint Lucia<\/strong><\/p>\n<p>Published 09.06.2020<\/p>\n<ol>\n<li>Airports in St. Lucia reopened.<\/li>\n<li>Passengers and airline crew:<\/li>\n<\/ol>\n<p>&#8211; must have a medical certificate with a negative Coronavirus (COVID-19) test result issued at most 48 hours before arrival; and<\/p>\n<p>&#8211; are subject to quarantine for 14 days.<\/p>\n<p><em> <\/em><\/p>\n<p><strong>Sweden<\/strong><\/p>\n<p>Published 03.07.2020<\/p>\n<p>Passengers are not allowed to enter until 31 August 2020.<br \/>\n-This does not apply to:<br \/>\n&#8211; passengers arriving from Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Switzerland and United Kingdom;<br \/>\n&#8211; nationals of Sweden;<br \/>\n&#8211; family members of nationals of Sweden;<br \/>\n&#8211; passengers with a residence permit issued by Sweden;<br \/>\n&#8211; nationals of Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, San Marino, Slovakia, Slovenia, Spain, Switzerland and Vatican City (Holy See), and their family members, returning via Sweden to their country of residence;<br \/>\n&#8211; passengers with a British passport and their family members, returning via Sweden to their country of residence;<br \/>\n&#8211; passengers with a residence permit issued by Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, San Marino, Slovakia, Slovenia, Spain, Switzerland, United Kingdom or Vatican City (Holy See), returning via Sweden to their country of residence;<br \/>\n&#8211; passengers with a national visa issued by Sweden;<br \/>\n&#8211; passengers with a national visa issued by Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, San Marino, Slovakia, Slovenia, Spain, Switzerland, United Kingdom or Vatican City (Holy See). The visa must be valid for more than 3 months;<br \/>\n&#8211; military personnel;<br \/>\n&#8211; passengers traveling as students;<br \/>\n&#8211; merchant seamen;<br \/>\n&#8211; effective 4 July 2020, residents of Algeria, Australia, Canada, Georgia, Japan, Korea (Rep.), Montenegro, Morocco, New Zealand, Rwanda, Serbia, Thailand, Tunisia and Uruguay.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Slovenia<\/strong><\/p>\n<div class=\"svgMap-tooltip-content\">\n<div>Published 01.07.2020<\/div>\n<div>1. Passengers are not allowed to enter.<br \/>\n&#8211; This does not apply to passengers arriving from Albania, Andorra, Armenia, Austria, Bahrain, Belarus, Bolivia, Bosnia and Herzegovina, Brazil, Cayman Isl., Chile, Croatia, Cyprus, Czechia, Denmark, Djibouti, Dominican Rep., Estonia, Finland, France, Gabon, Germany, Gibraltar, Greece, Hungary, Iceland, Iran, Ireland (Rep.), Italy, Kosovo (Rep.), Kuwait, Latvia, Liechtenstein, Lithuania, Maldives, Malta, Moldova (Rep.), North Macedonia (Rep.), Norway, Oman, Panama, Peru, Portugal, Puerto Rico, Qatar, Russian Fed., Sao Tome and Principe, Saudi Arabia, Serbia, Singapore, Slovakia, South Africa, Spain, Sweden, Switzerland, USA, United Arab Emirates or United Kingdom.<br \/>\n&#8211; This does not apply to nationals and residents of Slovenia.<br \/>\n&#8211; This does not apply to nationals of Andorra, Monaco, Montenegro, North Macedonia (Rep.), San Marino, Serbia and Vatican City (Holy See) returning via Slovenia to their country of residence.<br \/>\n&#8211; This does not apply to passengers with a diplomatic passport.<br \/>\n2. Passengers are subject to quarantine for 14 days.<\/div>\n<\/div>\n<p>&nbsp;<\/p>\n<p><strong>Switzerland<\/strong><\/p>\n<p>Published 03.06.2020<br \/>\n1. Passengers are not allowed to enter.<br \/>\n&#8211; This does not apply to nationals or residents of Switzerland or Liechtenstein.<br \/>\n&#8211; This does not apply to passenger with a cross-border commuter permit who are entering Switzerland for work, with a C-visa issued by Switzerland for the purpose of &#8220;business meetings&#8221; as specialists in the field of health or &#8220;official visit&#8221; of great importance, with a D-visa issued by Switzerland or who have an assurance of a residence permit.<br \/>\n&#8211; This does not apply to passengers traveling directly through Switzerland, provided that there are no reasons to believe that the country towards which they intend to leave Switzerland will refuse entry.<br \/>\n&#8211; This does not apply to passengers who have to travel to their place of work abroad, provided they can present a valid employment contract.<br \/>\n&#8211; This does not apply to passengers who are already legally residing within the EU\/EFTA area and that are travelling for tourist purposes, provided that they can credibly demonstrate that they actually want to\/can enter the destination country, e.g. by presenting a hotel booking, holiday apartment, etc.<br \/>\n&#8211; This does not apply to passengers who are entitled to freedom of movement (citizens of EU\/EFTA-states) and have a professional reason for entering Switzerland and have a confirmation of registration.<br \/>\n&#8211; This does not apply to passengers who are of great importance as specialists in the health sector.<br \/>\n2. Until and including 07.06.2020, passengers can only land at Basel (BSL), Geneva (GVA) or Zurich (ZRH).<\/p>\n<p><em> <\/em><\/p>\n<p><strong>Trinidad and Tobago<\/strong><\/p>\n<p>Published 30.03.2020<\/p>\n<p>Airports in Trinidad and Tobago are closed.<\/p>\n<p>&#8211; This does not apply if permitted by the Minister with responsibility for national security.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Tajikistan<\/strong><\/p>\n<p>Published 05.06.2020<br \/>\n1. Flights to Tajikistan are suspended.<br \/>\n2. Passengers and airline crew are subject to quarantine for 14 days.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Tunisia<\/strong><\/p>\n<div class=\"svgMap-tooltip-title\">Published 02.07.2020<\/div>\n<div class=\"svgMap-tooltip-content\">\n<div>1. Passengers are not allowed to enter.<br \/>\n&#8211; This does not apply to nationals of Tunisia and passengers with a permanent residence permit issued by Tunisia.<br \/>\n&#8211; This does not apply to passengers arriving from Andorra, Antigua and Barbuda, Australia, Austria, Azerbaijan, Bahamas, Barbados, Belize, Bosnia and Herzegovina, Brunei Darussalam, Bulgaria, Burkina Faso, Burundi, Cambodia, Cameroon, Canada, Chad, China (People&#8217;s Rep.), Chinese Taipei, Comoros, Cote d&#8217;Ivoire, Croatia, Cuba, Cyprus, Czechia, Denmark, Djibouti, Dominica, Dominican Rep., Ecuador, El Salvador, Estonia, Fiji, Finland, France, Gambia, Georgia, Germany, Ghana, Grenada, Guinea, Guyana, Hungary, Iceland, India, Indonesia, Iran, Ireland (Rep.), Italy, Jamaica, Japan, Jordan, Kazakhstan, Korea (Rep.), Kyrgyzstan, Lao People&#8217;s Dem. Rep., Latvia, Lebanon, Liechtenstein, Lithuania, Luxembourg, Malaysia, Maldives, Mali, Malta, Mauritius, Mexico, Monaco, Mongolia, Montenegro, Morocco, Nepal, New Zealand, Nicaragua, Niger, Norway, Pakistan, Paraguay, Portugal, Romania, Senegal, Serbia, Seychelles, Sierra Leone, Slovakia, Spain, Sri Lanka, St. Kitts and Nevis, St. Maarten, Switzerland, Tajikistan, Thailand, Timor-Leste, Togo, Trinidad and Tobago, Uganda, Uruguay, Uzbekistan, Viet Nam, Yemen or Zambia.<\/div>\n<div>2. Passengers arriving from Azerbaijan, Bahamas, Belize, Bosnia and Herzegovina, Bulgaria, Burkina Faso, Burundi, Cameroon, Canada, Comoros, Cyprus, Czechia, Djibouti, Dominican Rep., Ecuador, El Salvador, France, Gambia, Georgia, Ghana, Guinea, Guyana, Hungary, India, Iran, Jamaica, Jordan, Kazakhstan, Korea (Rep.), Kyrgyzstan, Latvia, Lebanon, Liechtenstein, Lithuania, Malaysia, Maldives, Mali, Mexico, Mongolia, Montenegro, Nepal, Nicaragua, Pakistan, Paraguay, Portugal, Romania, Senegal, Serbia, Sierra Leone, Spain, Sri Lanka, Togo, Uganda, Uzbekistan, Yemen or Zambia must have a medical certificate with a negative Coronavirus (COVID-19) PCR test result issued at most 72 hours before departure.<\/div>\n<div>3. Passengers are subject to quarantine for 14 days.<\/div>\n<div>4. A completed Health Declaration form must be presented before boarding and to immigration upon arrival.<\/div>\n<\/div>\n<p><strong> <\/strong><\/p>\n<p><strong>Tanzania<\/strong><\/p>\n<p>Published 19.05.2020<\/p>\n<ol>\n<li>Passengers are subject to medical screening upon arrival.<\/li>\n<li>Airline crew are subject to medical screening upon arrival and will be isolated if they are suspected of Coronavirus (COVID-19) infection.<\/li>\n<li>Airline crew arriving in Zanzibar (ZNZ) will be quarantined at the airlines designated hotels.<\/li>\n<li>A completed &#8220;Health Form&#8221; must be presented to the Ministry of Health personnel upon arrival.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<p><strong>Turks and Caicos Islands<\/strong><\/p>\n<p>Published 10.04.2020<\/p>\n<p>Airports in Turks and Caicos Isl. are closed.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Thailand<\/strong><\/p>\n<p>Published 10.07.2020<\/p>\n<p>1. Passengers and airline crew are not allowed to enter Thailand until 31 July 2020.<br \/>\n&#8211; This does not apply to:<br \/>\n&#8211; nationals and residents of Thailand;<br \/>\n&#8211; passengers who are spouses, parents or children of a national of Thailand;<br \/>\n&#8211; airline crew with a return scheduled flight;<br \/>\n&#8211; students.<br \/>\n2. Passengers must have a medical certificate with a negative Coronavirus (COVID-19) RT-PCR test result issued at most 72 hours before departure.<br \/>\n&#8211; This does not apply to nationals of Thailand.<br \/>\n3. Passengers must have:<br \/>\n&#8211; an insurance to cover medical expenses in Thailand, and<br \/>\n&#8211; a Certificate of Entry issued by Royal Thai Embassy, and<br \/>\n&#8211; a Fit to Fly health certificate.<br \/>\n4. Passengers are subject to medical screening and quarantine.<br \/>\n5. Airline crew are subject to self-isolation until their next flight.<br \/>\n6. Airline crew staying overnight must have a guarantee letter from the airline or a health insurance certificate with a coverage cost of at least USD 100,000.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Turkmenistan<\/strong><\/p>\n<p>Published 04.06.2020<br \/>\n1. Flights to Turkmenistan are suspended.<br \/>\n&#8211; This does not apply to repatriation flights of nationals and residents of Turkmenistan.<br \/>\n&#8211; This does not apply to technical stops if airline crew do not disembark the aircraft.<br \/>\n2. Passengers arriving in Turkmenistan:<br \/>\n&#8211; must have a medical certificate stating a negative Coronavirus (COVID-19) test result issued at most 72 hours before departure by the competent authority of the county of residency; and<br \/>\n&#8211; are subject to be tested for COVID-19 on arrival and to self-isolation for 14 days.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Togo<\/strong><\/p>\n<p>Published 25.04.2020<\/p>\n<p>Flights to Togo are suspended.<\/p>\n<p>&#8211; This does not apply to repatriation flights.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Turkey<\/strong><\/p>\n<p>Published 07.07.2020<br \/>\nPassengers and airline crews are subject to medical screening.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>United Arab Emirates<\/strong><\/p>\n<p>Published 08.06.2020<br \/>\n1. Flights to the United Arab Emirates are suspended.<br \/>\n&#8211; This does not apply to the following:<br \/>\n&#8211; aircraft operated for the purpose of evacuation (this Safety Decision does not alleviate the need for obtaining necessary authorisation from UAE Ministry of Foreign Affairs and International Cooperation);<br \/>\n&#8211; UAE registered aircraft that are out of base on 24 March 2020 23:59 Local Time will be allowed to return to base carrying only UAE nationals and operator’s crewmembers;<br \/>\n&#8211; over-flights.<br \/>\n2. All Evacuation flights must have PAX APP data and Crew APP data; all ferry flights must have crew APP data.<br \/>\n3. A completed self-declaration health form must be presented upon arrival at Dubai (DXB).<\/p>\n<p>&nbsp;<\/p>\n<p><strong>United Kingdom<\/strong><\/p>\n<p>Published 10.07.2020<\/p>\n<p>1. Passengers are subject to self-isolation for 14 days.<\/p>\n<p>2. A completed &#8220;Public Health Passenger Locator Form&#8221; must be presented to immigration upon arrival.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Uruguay<\/strong><\/p>\n<p>Published 27.05.2020<\/p>\n<ol>\n<li>Flights to Uruguay are suspended.<\/li>\n<\/ol>\n<p>&#8211; This does not apply to humanitarian flights.<\/p>\n<ol start=\"2\">\n<li>Passengers and airline crew will be placed in quarantine for 14 days.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<p><strong>United States Virgin Islands<\/strong><\/p>\n<p>Published 04.06.2020<\/p>\n<p>Passengers are subject to medical screening and quarantine.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Uganda<\/strong><\/p>\n<p>Published 25.05.2020<\/p>\n<ol>\n<li>Flights to Uganda are suspended.<\/li>\n<\/ol>\n<p>&#8211; This does not apply to:<\/p>\n<p>&#8211; aircraft in a state of emergency;<\/p>\n<p>&#8211; operations related to humanitarian aid, medical and relief flights;<\/p>\n<p>&#8211; technical landings where passengers do not disembark and<\/p>\n<p>&#8211; safety-related operation flights.<\/p>\n<ol start=\"2\">\n<li>Airline crew are subject to quarantine.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<p><strong>United States<\/strong><\/p>\n<p>Published 08.06.2020<\/p>\n<ol>\n<li>Passengers who have transited or have been in Austria, Belgium, Brazil, China (People&#8217;s Rep.), Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Iran, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Slovakia, Slovenia, Spain, Sweden, Switzerland or in the United Kingdom (excluding overseas territories outside of Europe), in the past 14 days are not allowed to enter the USA.<\/li>\n<\/ol>\n<p>-This does not apply to:<\/p>\n<p>&#8211; nationals and permanent residents of the USA;<\/p>\n<p>&#8211; spouses of nationals and of permanent residents of the USA;<\/p>\n<p>&#8211; parents\/legal guardians of an unmarried and younger than 21 years national or permanent resident of the USA;<\/p>\n<p>&#8211; the unmarried and younger than 21 years brother or sister of a national or permanent resident of the USA, who is unmarried and younger than 21 years;<\/p>\n<p>&#8211; the child\/foster child\/ward of a national or permanent resident of the USA;<\/p>\n<p>&#8211; passengers with the following visas: A-1, A-2, C-1, C-1\/D, C-2, C-3, D, E-1(as an employee of TECRO or TECO or the employee&#8217;s immediate family members), G-1, G-2, G-3, G-4, IR-4, IH-4, NATO-1 through NATO-4, or NATO-6 visa;<\/p>\n<p>&#8211; members of the U.S. Armed Forces, spouses, and children of members of the U.S. Armed Forces;<\/p>\n<p>&#8211; passengers with evidence of traveling at the invitation of the USA government for a purpose related to the containment\/mitigation of the Coronavirus (COVID-19);<\/p>\n<p>&#8211; passengers with documents issued by the U.S. Department of Homeland Security, U.S. Customs and Border Protection, or U.S. Department of State indicating that the passenger is exempt from the restriction;<\/p>\n<p>&#8211; B1 crew crewmembers that are engaged in lightering, Outer Continental Shelf (OCS) activity, wind farm activity, private air\/sea crew and other similar crewmember actives.<\/p>\n<ol start=\"2\">\n<li>Passengers who have been in one of the countries listed in bullet number 1 in the past 14 days but are exempt from the restriction to enter the USA, must arrive at one of the following airports: Atlanta (ATL), Boston (BOS), Chicago (ORD), Dallas, (DFW), Detroit (DTW), Ft. Lauderdale (FLL), Honolulu (HNL), Housten (IAH), Los Angeles (LAX), Miami (MIA), New York (JFK or EWR), San Francisco (SFO), Seattle (SEA) and Washington (IAD).<\/li>\n<li>Passengers who have been in Austria, Belgium, Brazil, China (People&#8217;s Rep.), Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Iran, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Slovakia, Slovenia, Spain, Sweden, Switzerland or United Kingdom (excluding overseas territories outside of Europe) in the past 14 days but are exempt from the restriction to enter the USA, must self-quarantine for 14 days once they reach their final destination.<\/li>\n<li>Passports issued to nationals of Belarus which have expired between 30 April 2020 and 31 July 2020, are considered valid with an extension of 3 months.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<p><strong>Ukraine<\/strong><\/p>\n<div class=\"svgMap-tooltip-title\"><\/div>\n<div class=\"svgMap-tooltip-content\">\n<div>Published 23.06.2020<br \/>\n1. Flights to Ukraine restarted.<br \/>\n2. Passengers must have insurance to cover medical expenses in Ukraine.<br \/>\n3. Passengers are subject to quarantine.<\/div>\n<\/div>\n<p>&nbsp;<\/p>\n<p><strong>Uzbekistan<\/strong><\/p>\n<p>Published 24.03.2020<br \/>\nFlights to Uzbekistan are suspended.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Venezuela<\/strong><\/p>\n<div class=\"svgMap-tooltip-content\">\n<div>Published 14.07.2020<\/div>\n<div><\/div>\n<div>Flights to Venezuela are suspended until 12 August 2020.<br \/>\n&#8211; This does not apply to humanitarian flights.<\/div>\n<\/div>\n<p>&nbsp;<\/p>\n<p><strong>Vanuatu<\/strong><\/p>\n<p>Published 30.03.2020<br \/>\nVanuatu ports of entry are closed.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Virgin Isl. (British)<\/strong><\/p>\n<p>Published 04.06.2020<\/p>\n<p>Passengers are not allowed to enter.<\/p>\n<p>&#8211; This does not apply to residents of Virgin Isl. (British).<\/p>\n<p><strong> <\/strong><\/p>\n<p><strong>Vietnam<\/strong><\/p>\n<p>Published 22.05.2020<br \/>\n1. Passengers are not allowed to enter Viet Nam.<br \/>\n&#8211; This does not apply to passengers on diplomatic or official duty. They will be subject to mandatory medical declaration and self-isolation.<br \/>\n&#8211; This does not apply to passengers who are experts, business managers or highly skilled workers. They will be subject to mandatory medical declaration and self-isolation.<br \/>\n&#8211; This does not apply to passengers approved by National Steering Committee on Covid-19 Prevention and Control.<br \/>\n2. For transportation of nationals of Vietnam returning to Vietnam, airlines must contact the Vietnamese Diplomatic Representative agency in the local country in advance.<br \/>\n3. All passengers will be placed on quarantine at a designated facility for 14 days upon arrival.<br \/>\n4. All visa issuances are suspended.<br \/>\n5. All passengers must fill out a quarantine form prior to arrival.<br \/>\n6. Passengers who travel for diplomatic or official purpose will undergo a medical examination at the border.<br \/>\n7. Nationals of Italy and Korea (Rep.) with a normal passport are no longer visa exempt.<br \/>\n8. Nationals of Denmark, Finland, France, Germany, Norway, Spain, Sweden and passengers with a British passport are no longer visa exempt.<br \/>\n9. Passengers with a Certificate of Visa Exemption issued by Viet Nam are no longer visa exempt if they reside in China (People&#8217;s Rep.), Denmark, Finland, France, Germany, Iran, Italy, Korea (Rep.), Norway, Spain, Sweden or United Kingdom.<br \/>\n10. Nationals of Belarus, Japan and Russian Fed. with a normal passport are no longer visa exempt.<br \/>\n11. Nationals of Belarus, Japan and Russian Fed. with a normal passport and with a Certificate of Visa Exemption issued by Viet Nam are no longer visa exempt.<br \/>\n12. Airline crew are subject to mandatory medical declaration as well as observing self-quarantine during their stay until the next flight schedule.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Yemen<\/strong><\/p>\n<p>Latest Updates currently under review<\/p>\n<p><em> <\/em><\/p>\n<p><strong>Zambia<\/strong><\/p>\n<p>Published 27.03.2020<\/p>\n<ol>\n<li>All flights must arrive at Lusaka (LUN).<\/li>\n<li>Passengers and airline crew must quarantine for at least 14 days at their own costs.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<p><strong>Zimbabwe<\/strong><\/p>\n<p>Published 19.05.2020<\/p>\n<ol>\n<li>Except for BUQ, HRE and VFA, airports are closed.<\/li>\n<li>BUQ, HRE and VFA airports are open for the following flights:<\/li>\n<\/ol>\n<p>&#8211; flights carrying staff for essential services or sick persons to hospitals and other health care providers;<\/p>\n<p>&#8211; flights carrying a member of the staff of a foreign mission or agency going to or from such mission or agency, or a citizen, resident or protected subject of a foreign country going to or from a foreign mission of the country of which he or she is the citizen, resident or subject, for the purpose of obtaining services or assistance at such mission;<\/p>\n<p>&#8211; flights carrying police, defence forces personnel and other enforcement officers.<\/p>\n<p>&nbsp;<\/p>\n<p>If any new travel restrictions will be imposed, we will ensure that Timatic is updated accordingly. We are monitoring this outbreak very closely and we will keep you posted on the developments.<\/p>\n<p><span style=\"color: #808080;\">Source: IATA     Last Updated: 15 July 2020<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>COVID-19 ALERT: STATE OF SHUT DOWN EXTENDED IN BANGLADESH UNTIL  15  July 2020  Visa on arrival suspended for all nationalities. Flights from Iran, Bhutan, Maldives, Sri Lanka and Europe except UK are suspended until 30 June 2020; Bahrain, India, Kuwait, Malaysia, Oman, Qatar, Saudi Arabia, Singapore, Turkey and UAE suspended until 15 April 2020. Travelers [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":5454,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"yst_prominent_words":[891,892,890,704,698,941,700,1728,701,696,702,706,942,889,1706,1707,943,945,692,944],"_links":{"self":[{"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/posts\/5451"}],"collection":[{"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/comments?post=5451"}],"version-history":[{"count":115,"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/posts\/5451\/revisions"}],"predecessor-version":[{"id":5944,"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/posts\/5451\/revisions\/5944"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/media\/5454"}],"wp:attachment":[{"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/media?parent=5451"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/categories?post=5451"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/tags?post=5451"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/yst_prominent_words?post=5451"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}