{"id":5930,"date":"2020-10-25T07:14:01","date_gmt":"2020-10-25T07:14:01","guid":{"rendered":"https:\/\/visathing.com\/?p=5930"},"modified":"2020-10-25T07:26:10","modified_gmt":"2020-10-25T07:26:10","slug":"we-will-travel-again-in-2021-heres-how-and-when-to-plan-your-next-trip","status":"publish","type":"post","link":"https:\/\/visathing.com\/we-will-travel-again-in-2021-heres-how-and-when-to-plan-your-next-trip\/","title":{"rendered":"We Will Travel Again in 2021"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p><strong>We Will Travel Again in 2021 —Here’s How and When to Plan Your Next Trip<\/strong><\/p>\n<p>These are not normal times. These are not normal times for the people of Bangladesh, India, Italy, Brazil, Russia or any other country hit hard by COVID-19. And these times are not normal for those seeing the pandemic on the horizon, feeling the anxiety of battling the invisible enemy that’s rattling our world physically, emotionally, economically, and culturally. With the world under lockdown, and with increasingly stringent restrictions coming into place across North America, Europe, the United Kingdom, Asia, and beyond, many are asking how they can still plan travel—and have something hopeful to look forward to—in a time of ongoing and ever-accelerating shutdown.<\/p>\n<p>A lot has happened in the past seven months as countries around the world fight the coronavirus pandemic and experience varying degrees of lockdown. Now that restrictions are beginning to loosen, travelers might be able to envision a vacation a bit more. In the past few weeks, some countries have begun opening their borders to tourists, though the State Department still advises against any unnecessary international travel for those traveling from the U.S.<\/p>\n<p>The love for traveling has taught us that our global community is defined by mobility, by the promise of exploring something new, and by the small world that manifests each time we pack our bags and leave our homes. Of course, it would be irresponsible for us to recommend that you travel now, so we won’t. Instead, we’re going to provide clear and useful information and advice to help you plan for your journeys in the months ahead and into 2021. Of equal importance, we’re also going to provide the needed inspiration to get you there.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>HOW DO I PLAN FOR TRAVEL IN UNCERTAIN TIMES?<\/strong><\/p>\n<p>Many different travel restrictions of varying intensities are currently in place across the globe. At the time of this publication, gatherings of more than two people are still prohibited in many countries. Self-quarantines of 14 days are advised for anyone traveling to or from global hot spots. In Schengen countries like Austria, Germany, Poland, Portugal, Belgium are not receiving short term category visas. They are only receiving national category D-type of visas.<\/p>\n<p>This situation is fluid, to say the least, and we expect that it will continue to morph, evolve, and react to the pandemic’s unpredictable ebbs and flows. Keep an eye on the Centers for Disease Control and Prevention (CDC), World Health Organization (WHO), and State Department websites. Staying informed—via direct, trusted sources—is the best way to keep abreast of the travel restrictions and bans as they happen (and disappear again).<\/p>\n<p>While discretionary travel is currently ill-advised, any and all required travel (and leisure travel that takes place soon after restrictions are lifted) should be undertaken with a holistic awareness of government policies—both of your own government and that of the country you’re intending to travel to. You can obtain this information via the CDC, but also directly from the embassy and country websites. Many journeys and routes may not be accessible for many weeks or months, and those timelines may be extended as the disease spreads and wanes in various parts of the world.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>CAN I STILL PLAN TO TRAVEL IN THE SUMMER?<\/strong><\/p>\n<p>The most important thing to note, at this time, is that we sadly don’t know. Circumstances could get worse, or they could get better, should our global community commit to battling this pandemic through testing, social distancing, and other CDC-advised measures (and we are hopeful for the latter). It’s only natural from the condition of isolation to think about summer travel, several months away. Come summer, some countries may find themselves safe, and routes may indeed open up, but it’s our responsibility to be prepared, and in turn prepare you, for the opposite.<\/p>\n<p>Prepare a contingency plan for all the travel you have planned (or are planning) for the summer months, in terms of both timing and location. You may find yourselves needing to postpone travel altogether, but the likelihood is that you’ll find yourself itching to travel with limitations on where to go. Dream now about the places close to home that you’ve always wanted to explore, but never had the chance. Alternatively, think of how and when you would put this trip off in the future when things are more stable. Consider all the possible outcomes, ideally in collaboration with a trusted agent, and you’re less likely to face disappointment.<\/p>\n<p>&nbsp;<\/p>\n<p><img loading=\"lazy\" class=\"alignnone size-medium wp-image-5935\" src=\"https:\/\/visathing.com\/wp-content\/uploads\/2020\/10\/Vacation-Search-Destinations-1-300x154.jpg\" alt=\"\" width=\"300\" height=\"154\" srcset=\"https:\/\/visathing.com\/wp-content\/uploads\/2020\/10\/Vacation-Search-Destinations-1-300x154.jpg 300w, https:\/\/visathing.com\/wp-content\/uploads\/2020\/10\/Vacation-Search-Destinations-1.jpg 680w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/><\/p>\n<p><strong>Most Popular 2021 Vacation Search Destinations<\/strong><\/p>\n<p>When looking at data continent by continent, the results were a bit different. In Europe, the top destination was the Maldives. In Asia, the UAE and Canada topped the list. In Africa, the UAE also came out on top, and in South America, it seems searchers are looking to stay a bit closer to home as their top searched 2021 destination was Peru. Overall, the top searched destinations combining the worldwide data have UAE coming in at number one followed by Qatar, U.S., Canada, and Egypt. In Europe, countries are hesitant to allow American tourists at the moment, issuing a travel ban on all countries within the EU. Croatia, however, has chosen to ignore the recommendation and began allowing American tourists earlier this month. Other countries not affected by the ban, including some on Kuoni&#8217;s list such as the Maldives and Dubai within the UAE, are allowing American visitors this summer, though many might choose to hold off until the new year to make any big plans.<\/p>\n<p>&nbsp;<\/p>\n<p><img loading=\"lazy\" class=\"alignnone size-medium wp-image-5936\" src=\"https:\/\/visathing.com\/wp-content\/uploads\/2020\/10\/is-it-ok-to-fly-1-300x154.jpg\" alt=\"\" width=\"300\" height=\"154\" srcset=\"https:\/\/visathing.com\/wp-content\/uploads\/2020\/10\/is-it-ok-to-fly-1-300x154.jpg 300w, https:\/\/visathing.com\/wp-content\/uploads\/2020\/10\/is-it-ok-to-fly-1.jpg 680w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/><\/p>\n<p><strong>IS IT OK TO FLY?<\/strong><\/p>\n<p>Coronavirus won’t stop overnight. Rather, its spread will decline at different paces in different places. Should you begin a trip while the coronavirus is still active in certain parts of the world, there will be many things to keep in mind that while the risk of infection during air travel is broadly low, airports and other transport hubs should be navigated with care. Follow the best-practice advice offered by the CDC and WHO on how to minimize the risk of infection, whether you’re flying in the coming months or into the summer and fall.<\/p>\n<p>&nbsp;<\/p>\n<p><img loading=\"lazy\" class=\"alignnone size-medium wp-image-5937\" src=\"https:\/\/visathing.com\/wp-content\/uploads\/2020\/10\/thinking-about-travel-1-300x154.jpg\" alt=\"\" width=\"300\" height=\"154\" srcset=\"https:\/\/visathing.com\/wp-content\/uploads\/2020\/10\/thinking-about-travel-1-300x154.jpg 300w, https:\/\/visathing.com\/wp-content\/uploads\/2020\/10\/thinking-about-travel-1.jpg 680w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/><\/p>\n<p><strong>HOW SHOULD I BE THINKING ABOUT TRAVEL NOW?<\/strong><\/p>\n<p>Now is not the time to travel. And yet, the travel industry—which includes everyone from major airlines to tiny street food vendors—is dependent not on your desire to travel and explore, but on your actually doing it. The spread of COVID-19, alongside its immediate health impacts, may cause untold damage to this vast, extremely diverse, and connected community. To put it more bluntly, and more passionately (because these are passionate times), if tourism is affected, then the countries, cities, establishments, and small businesses supported by tourism are also affected, as are the people and communities who make them what they are. Ultimately, when done sensitively and carefully, there is enormous value in planning now —and planning flexibly—for your travels ahead. Look to the near future, and look to fall or into the early days of winter 2021. Not only will you be ready at the starting gate when conditions do improve, but you’ll also experience that powerful psychological boost of having something uplifting and inspiring to look forward to.<\/p>\n<p>The coronavirus epidemic is hitting all of us. It has done damage, and it will continue to do damage. But we can limit its impact in an act of impassioned solidarity. We can show faith in the world and in the people who inhabit it. For these people and their communities, each itinerary, planned trip, and future journey booked today will offer them real, tangible funds to stay afloat at a time when many are at risk of closing their doors for good. We’ve currently pressed pause on travel, but it should be our common goal to come back to a world just as vibrant, inspiring, and ready to explore (if not more) once we press play. If the coronavirus pandemic subsides or a COVID-19 vaccine is released, 2021 could be a great time for European travel, thanks to discounts and smaller crowds as visitors slowly trickle back to popular tourism sites. However, the situation could change, so build as much flexibility as possible into your travel plans. Also, if you&#8217;re in a high-risk group, don&#8217;t take chances with your health&#8211;or your life.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; We Will Travel Again in 2021 —Here’s How and When to Plan Your Next Trip These are not normal times. These are not normal times for the people of Bangladesh, India, Italy, Brazil, Russia or any other country hit hard by COVID-19. And these times are not normal for those seeing the pandemic on [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":5931,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[274,129],"tags":[],"yst_prominent_words":[656,659,774,408,652],"_links":{"self":[{"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/posts\/5930"}],"collection":[{"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/comments?post=5930"}],"version-history":[{"count":4,"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/posts\/5930\/revisions"}],"predecessor-version":[{"id":5945,"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/posts\/5930\/revisions\/5945"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/media\/5931"}],"wp:attachment":[{"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/media?parent=5930"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/categories?post=5930"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/tags?post=5930"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/yst_prominent_words?post=5930"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}