{"id":2186,"date":"2019-01-05T18:45:23","date_gmt":"2019-01-05T18:45:23","guid":{"rendered":"http:\/\/yourtripmate.com\/vtexpress\/?page_id=2186"},"modified":"2021-01-05T11:31:08","modified_gmt":"2021-01-05T11:31:08","slug":"faqs","status":"publish","type":"page","link":"https:\/\/visathing.com\/faqs\/","title":{"rendered":"Frequently Asked Questions (FAQs)"},"content":{"rendered":"<p><strong>Question: How can I get immigration approval for Vietnam?<\/strong><\/p>\n<p>Answer:   VISAThing provides complete visa processing service for Vietnam visa including immigration approval.<\/p>\n<p><strong>Question: How can I process the New Zealand visa?<\/strong><\/p>\n<p>Answer:   New Zealand visas can be processed either by lodging paper-based application or by applying online. In both cases, original passports need to be sent in India for verification. VISAThing provides complete visa processing service for New Zealand including passport verification service.<\/p>\n<p><strong>Question: Is visa interview mandatory for Brazil visa?<\/strong><\/p>\n<p>Answer:   Requirement of visa interview entirely depends on the discretion of the consular office. However, in most cases, Brazil Embassy in New Delhi calls visa applicant for a visa interview.<\/p>\n<p><strong>Question: What kind of support we provide for Mozambique?<\/strong><\/p>\n<p>Answer:   Mozambique provides on-arrival visa facility for Bangladeshis. Detailed information can be found in our website- <a href=\"https:\/\/visathing.in\/country\/mozambique\">www.visathing.com\/country\/mozambique<\/a><\/p>\n<p><strong>Question: I need a work permit, can VISAThing arrange a work permit for me?<\/strong><\/p>\n<p>Answer:   VISAThing only provide visa services for long term employment visas. VISAThing doesn’t arrange or provide work permits for any country.<\/p>\n<p><strong>Question: Is a visa interview mandatory for ordinary passport holder applying for a Mexico visa?<\/strong><\/p>\n<p>Answer: Yes, it is mandatory.<\/p>\n<p><strong>Question: Does VISAThing provide any kind of support for passport renewal?<\/strong><\/p>\n<p>Answer:   No, VISAThing doesn’t provide passport services<\/p>\n<p><strong>Question: What is the Yellow Fever Vaccine?<\/strong><\/p>\n<p>Answer:   Yellow Fever Vaccine is a mandatory pre-requisite if someone wants to travel to the African or the North American regions that fall under the Yellow Fever affected zones. One must take the vaccine from a nearby hospital and hold the original vaccination card during the travel period.<\/p>\n<p><strong>Question: I want to travel to South Africa. Do I need the yellow fever vaccine for South Africa?<\/strong><\/p>\n<p>Answer: No, Yellow Fever Vaccination is no longer a mandatory requirement for traveling to South Africa.<\/p>\n<p><strong>Question: Can I apply for Zambia Visa without a Yellow Fever Vaccination Card?<\/strong><\/p>\n<p>Answer:   No, Yellow Fever Vaccination card is mandatory for applying to Zambia visa.<\/p>\n<p><strong>Question: What kind of service does VISAThing provide?<\/strong><\/p>\n<p>Answer:   VISAThing works as a visa service provider enabling travelers to travel to different countries seamlessly. To learn more about VISAThing’s services, please visit <a href=\"https:\/\/visathing.in\/services\">www.visathing.com\/services<\/a><\/p>\n<p><strong>Question: Can you give visa assistance for a Schengen visa?<\/strong><\/p>\n<p>Answer:   VISAThing provides comprehensive consultancy services for Schengen visa.<\/p>\n<p><strong>Question: If I apply for a visa through VISAThing, do I get the guarantee of getting a visa?<\/strong><\/p>\n<p>Answer: VISAThing is a visa service provider working to assist travelers with visa processing. Visa decision depends entirely on the discretion of the Embassy\/Consular Office. VISAThing doesn’t have any influence over the visa decision. However, VISAThing’s consultancy service examines your visa applications, finds possible causes of rejection and guides you to a better approach accordingly.<\/p>\n<p><strong>Question: What are the documents required for a visa application?<\/strong><\/p>\n<p>Answer:   Document requirements widely vary depending on country, visa category and purpose of visit. Please visit our website <a href=\"https:\/\/visathing.in\">www.visathing.com<\/a> to learn about the requirements for the country you want visit.<\/p>\n<p><strong>Question: How long will it take to process a visa?<\/strong><\/p>\n<p>Answer:  Visa processing times for different countries depend on the respective embassies’ guidelines. Usually most of the visas are processed within 2-3 weeks. For Visa processing services in India, additional 6 working days are required for passport and document transit.<\/p>\n<p><strong>Question: Are you an agent of the embassy?<\/strong><\/p>\n<p>Answer:  VISAThing is a premium visa service provider in Bangladesh. VISAThing works as an authorized representative of the visa seeker and process the visa application with efficiency.<\/p>\n<p><strong>Question: Is it possible to apply for a tourist visa without an invitation letter?<\/strong><\/p>\n<p>Answer:    For a tourist visa, you do not need any invitation letter. However, cover letter, day to day travel plan, airline ticket itinerary and hotel reservation copy are required.<\/p>\n<p><strong>Question: Does a 12-year-old need to apply for visa?<\/strong><\/p>\n<p>Answer:    Yes, a visa will be required for 12-year-old traveler.<\/p>\n<p><strong>Question: If my visa application gets rejected, do I get back the visa fee and other service charges?<\/strong><\/p>\n<p>Answer:    Visa fees and other service charges are not refundable payments made for visa processing.<\/p>\n<p><strong>Question: Do you provide documents for a visa?<\/strong><\/p>\n<p>Answer: VISAThing doesn’t provide any documents and stands strictly against counterfeit documents. VISAThing only assist you on preparing the supporting documents in line with the purpose of your travel and your profile.<\/p>\n<p><strong>Question: Are you a government organization?<\/strong><\/p>\n<p>Answer:    VISAThing is a registered private organization working on travel technologies based out of Dhaka, a member of TOAB and BASIS. However, we regularly work with different government organizations; its officials and diplomats to assist them on visa processing.<\/p>\n<p><strong>Question: Can you provide an invitation letter for business visa?<\/strong><\/p>\n<p>Answer: VISAThing doesn’t provide Invitation letter. Invitation Letter must be provided by the invitee of the business trip.<\/p>\n<p><strong>Question: Which category of visa is required for attending a conference or workshop?<\/strong><\/p>\n<p>Answer:    Business\/Conference visa is required if anyone wants to attend a conference\/workshop in another country.<\/p>\n<p><strong>Question: Is there any alternative document for bank statement that is acceptable when applying for a visa?<\/strong><\/p>\n<p>Answer:    Bank statement and other evidence of fund is mandatory when applying for a visa. Only Indian visa can be obtained with currency endorsement certificate.<\/p>\n<p><strong>Question: How can I track my passport?<\/strong><\/p>\n<p>Answer:  You can track your passport using the VISAThing Tracking Number and passport tracker box on the top-right corner of our website – <a href=\"https:\/\/visathing.in\">www.visathing.com<\/a><\/p>\n<p><strong>How can I contact you for taking an appointment?<\/strong><\/p>\n<p>Ans: You can call us on our hotline number 0196 777 7788 from Saturday to Thursday; from 9.30 am to 6.00 pm. Alternatively, you can email us at <a href=\"mailto:cr@visathing.com\">cr@visathing.com<\/a> or reach out to our social media pages for support.<\/p>\n<p><strong>Question: Do I need an invitation to Ghana?<\/strong><\/p>\n<p>Ans: Yes, Original copy of the invitation letter and the postal envelop are required for Ghana visa application.<\/p>\n<p><strong>Question: I got confused while applying online for New Zealand visa. Does VISAThing help us regarding this issue?<\/strong><\/p>\n<p>Answer:    Yes, VISAThing will guide you through your online application form for New Zealand visa.<\/p>\n<p><strong>Question: I do not have any bank statement but I want to apply for a visa. Does VISAThing provide any kind of support regarding this?<\/strong><\/p>\n<p>Answer: A visa seeker must have his\/her own financial statements as an evidence of adequate funds for international travel.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Question: How can I get immigration approval for Vietnam? Answer:   VISAThing provides complete visa processing service for Vietnam visa including immigration approval. Question: How can I process the New Zealand visa? Answer:   New Zealand visas can be processed either by lodging paper-based application or by applying online. In both cases, original passports need to be [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"yst_prominent_words":[635,653,629,624,657,651,646,655,649,627,634,368,644,389,647,626,631,641,637,639],"_links":{"self":[{"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/pages\/2186"}],"collection":[{"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/comments?post=2186"}],"version-history":[{"count":12,"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/pages\/2186\/revisions"}],"predecessor-version":[{"id":5036,"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/pages\/2186\/revisions\/5036"}],"wp:attachment":[{"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/media?parent=2186"}],"wp:term":[{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/yst_prominent_words?post=2186"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}