{"id":5662,"date":"2020-06-04T21:33:22","date_gmt":"2020-06-04T21:33:22","guid":{"rendered":"https:\/\/visathing.com\/?page_id=5662"},"modified":"2020-06-04T21:33:22","modified_gmt":"2020-06-04T21:33:22","slug":"terms-and-conditions","status":"publish","type":"page","link":"https:\/\/visathing.com\/terms-and-conditions\/","title":{"rendered":"Terms and Conditions"},"content":{"rendered":"<p>Important – Please Read the Terms and Conditions Thoroughly and Carefully. Availing Any Service from VISAThing™ Is Subject to Complete Acceptance of the Terms and Conditions set out below:<\/p>\n<p>&nbsp;<\/p>\n<ol>\n<li><strong><u>General Terms<\/u><\/strong>\n<ul>\n<li>VISAThing™ – a registered trademark of Your Trip Mate Ltd trading as VISAThing™ (herein after called VISAThing™) acts as a visa service provider on behalf of their Client\/Service Recipient(s) for processing visa\/permits and ancillary services from the appropriate institutions and\/or immigration authorities.<\/li>\n<li>By registering with us\/availing our services\/making payment for our service(s) at our premise or through electronic means by using our online platform or mobile application, a service recipient is deemed to have fully understood and accepted these terms and conditions herein; therefore, agrees to abide by terms and conditions as set out here. VISAThing™ reserves the right not to provide any service without the client agreeing to the terms and conditions\/any portion of it as set out here.<\/li>\n<li>These Terms &amp; Conditions govern the provision of all information or services provided by VISAThing™ in the processing of visa applications and other ancillary services for their Client\/Service Recipient(s). For all the orders made to VISAThing™ Client\/Service Recipient(s) are subject to the terms and conditions set out herein.<\/li>\n<li>Any prospective client opting for a visa processing\/document legalization through VISAThing™ must ensure that they are of legal age to register for our service with authentic data and documents in his\/her own name in their country of residence. VISAThing™ doesn’t take the responsibility to examine and confirm the legal identity of its client(s).<\/li>\n<li>All the information on our websites is current to the date of publication and may be subject to change.<\/li>\n<li>VISAThing™ is entitled to include additional Terms &amp; Conditions should the need arise. The submission of documents to VISAThing™ by web, post, fax, email, constitutes agreement to these Terms &amp; Conditions, including amendments thereto, by the customer.<\/li>\n<li>Any visa application request submitted to VISAThing™ by a representative on behalf of his\/her client (traveller) must come with a duly signed Letter of Authority; therefore, will be deemed to be an application submitted to VISAThing™ by the client (traveler) directly to VISAThing™. All terms and conditions listed herein apply to both the representative and the client (traveler) equally.<\/li>\n<li>Should one or more term or condition of this agreement be declared void by a recognized Court of Justice, then the remaining Terms &amp; Conditions would retain their validity. These Terms &amp; Conditions represent the whole of the agreement between VISAThing™ and the Client, and replace any previous written or verbal agreement, communicated by VISAThing™<\/li>\n<\/ul>\n<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<ol start=\"2\">\n<li><strong><u>Terms on Privacy<\/u><\/strong>\n<ul>\n<li>The Client\/group of Client(s) agrees and presents consent that we may collect, process, use and record personal information provided in connection with the visa processing service availed. Only the service provider and associated bodies (Consular Offices\/Immigration Offices) can access to the information.<\/li>\n<li>After the provision of service(s) is complete and the service is closed, VISAThing™ may discard all the personal information received for the visa application processing.<\/li>\n<li>After the provision of service(s) is complete and the service is closed, VISAThing™ reserves the right to store your contact information for future reference and may use the information only for the identification of our recurring clients’ eligibility for promotional discounts, loyalty program memberships and latest updates on visa\/travel scenario.<\/li>\n<li>VISAThing’s privacy policy is a part of this Terms and Conditions. Agreeing to this Terms and Condition also means a service user accepts the privacy policy. Privacy Policy is published in our website for everyone’s convenience.<\/li>\n<\/ul>\n<\/li>\n<\/ol>\n<p><u> <\/u><\/p>\n<ol start=\"3\">\n<li><strong><u>Terms of Using Online Visa Application System: <\/u><\/strong>\n<ul>\n<li>While applying for a visa or requesting a VISAThing’s service online, a service user is entitled to fill-in all the required information, VISAThing will not be held liable for any mistakenly filled-in the application field(s).<\/li>\n<li>While applying for a visa or requesting a VISAThing’s service online, a service user is entitled to select the appropriate service(s), payment options etc. VISAThing will not be held liable for any mistakenly selected and\/or paid service(s).<\/li>\n<li>While applying for a visa or requesting a VISAThing’s service online, a service user is entitled to upload all the required documents as per the embassy’s instruction. A service user is also entitled to communicate to VISAThing regarding original passport\/original documents submission to VISAThing’s office.<\/li>\n<\/ul>\n<\/li>\n<\/ol>\n<p><u> <\/u><\/p>\n<ol start=\"4\">\n<li><strong><u>Terms on Service Processing Time<\/u><\/strong>\n<ul>\n<li>Document Transit time and Visa processing times mentioned on websites\/published materials are standard processing timeframes according to the respective immigration authorities’ guidelines. Any estimated timeframe advised by VISAThing™ should be used as a guide only.<\/li>\n<li>VISAThing™ aims to process the visa application within the timeframes committed in its published materials. VISAThing™ will use its best endeavors to minimize any delay or inconvenience caused in this respect. VISAThing™ will not be held responsible for any unavoidable delay in service delivery caused by the immigration authorities or other associated party.<\/li>\n<\/ul>\n<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<ol start=\"5\">\n<li><strong><u>Consultancy Service Definition<\/u><\/strong>\n<ul>\n<li>VISAThing™ will be able to take any emergency decision(s) related to the documentation and processing of Visa Application<\/li>\n<li>VISAThing™ cannot influence: any decision made by an immigration authority; any requests for additional information before finalizing a visa; any delay by an immigration authority in the issuing of a visa; or a decision to refuse a visa. Any assistance to reach out to the respective authority to request an update\/expedite the processing shall only be treated as a token of complement.<\/li>\n<li>Consultancy Service consists of Primary Information Session, Document Processing and Service Delivery Session along with assistance\/guidance on the entire process. Any additional information session can only be scheduled by the consultant if necessary. A Client\/applicant is responsible to provide all the relevant information and documents in connection of his requested consultancy service.<\/li>\n<li>A client\/applicant reserves the right to choose whether to provide or avoid providing any of the requested documents mentioned in the customized visa checklist prepared by one of our consultants. VISAThing™ will use and rely on information provided by the client in the provision of services to that client. VISAThing™ will not independently verify or assume responsibility for the accuracy, authenticity or completeness of such information\/document.<\/li>\n<li>VISAThing™ processes all the paperwork based on the merits of the documents received, the client’s personal profile and background information related to social as well as professional occupancies. All the documents prepared, compiled or revised by VISAThing™ are sent to the client for review before finalization. A client may suggest, comment or input any information as and where necessary.<\/li>\n<li>VISAThing™ does not carry further any liability to the client once the contracted service is completed with the client. This limitation on duty of care includes but is not limited to information; advice or opinion provided by VISAThing™ after the contracted service is complete, any event of deportation, restriction on entry etc.<\/li>\n<li>Services entitled upon the availability of dates at the discretion of a consular office, an associate party or immigration authorities such as booking embassy appointment.<\/li>\n<li>The Client\/Service recipient(s) agrees for VISAThing™ to keep Client\/Service Recipient(s) updated by automated website tracking. Only in case of emergency, an applicant can reach us through our Hotline phone number and Customer Relation e-mail about any available updates about on-going applications. Response to calls and emails shall only be expected during the standard working hours on weekdays at the earliest. Please note, all the queries received through phone calls and emails are served in que. It is the applicant’s responsibility to inform VISAThing™ about any emergency update received at his end in connection to his on-going visa application during the working hours.<\/li>\n<li>VISAThing™ reserves the right, at our discretion, to change our associate service providers or any other parties involved in providing any of our ancillary services as deemed appropriate by VISAThing™.<\/li>\n<li>VISAThing™ reserves the right to contact your sponsor\/employer should further details be required from the authorities or for confirmation of your application.<\/li>\n<\/ul>\n<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<ol start=\"6\">\n<li><strong><u>Visa Processing (Logistic) Service Definition<\/u><\/strong>\n<ul>\n<li>VISAThing™ will be able to take any emergency decision(s) related to all the associated activities related to the processing and transit of Visa Application\/Document Legalization.<\/li>\n<li>Standard service fee covers up to 0.75 kg of documents to send through courier. An extra logistics charge will applicable if the total documents weights more than 0.75kg.<\/li>\n<li>Logistic Service covers Approval Fee and other charges at Ministry of Home Affairs, processing and screening on documents, both way courier charge for transiting documents\/passport to designated immigration offices and retrieve it back once the processing is completed.<\/li>\n<li>If an immigration authority has incorporated a deadline for the submission of documents to an application, these documents must be provided at the earliest possible time but no later than 72 hours prior to the deadline date.<\/li>\n<li>For any visa, in particular a tourist or business visa, the client should not book a flight ticket unless the embassy has specifically requested evidence of this as a requirement for the visa application. Any suggestions on the tentative date of receiving visa decision or passport delivery shall be treated as a guideline only.<\/li>\n<li>VISAThing™ reserves the right to contact your sponsor\/employer should further details be required from the authorities or for confirmation of your application.<\/li>\n<li>VISAThing™ reserves the right, at our discretion, to change our associate service providers or any other parties involved in providing any of our ancillary services as deemed appropriate by VISAThing™.<\/li>\n<li>The Client\/Service recipient(s) agrees for VISAThing™ to keep Client\/Service Recipient(s) updated by automated website tracking. Only in case of emergency, an applicant can reach us through our Hotline phone number and Customer Relation e-mail about any available updates about on-going applications. Response to calls and emails shall only be expected during the standard working hours on weekdays at the earliest. Please note, all the queries received through phone calls and emails are served in que. It is the applicant’s responsibility to inform VISAThing™ about any emergency update received at his end in connection to his on-going visa application during the working hours.<\/li>\n<\/ul>\n<\/li>\n<\/ol>\n<p><u> <\/u><\/p>\n<ol start=\"7\">\n<li><strong><u>Payment &amp; Refund Policies<\/u><\/strong>\n<ul>\n<li>The fees for VISAThing’s services shall be those specified on the website, including any indirect taxes, if applicable, that are applicable to the fees, and other charges and fees charged by an issuing authority, all of which must be paid by you.<\/li>\n<li>All the services of VISAThing™ must be availed directly from VISAThing™ and VISAThing™ authorized franchise through direct or electronically. Prepayment of Service charges in full is mandatory for availing any of the services. Once the Automated Tracking ID is generated, service charges paid to VISAThing™ are non-refundable.<\/li>\n<li>Should you choose to purchase any of the services offered by VISAThing™, either electronically or through a third party; and wish to settle payment for that service by either cash, cards, bank transfer, internet banking, mobile banking or other online payment gateways; you acknowledge that you agree to the VISAThing™ terms of services. You acknowledge that you are responsible for any additional fees that may be required to facilitate the visa processing or ancillary service including but not limited to fees in connection with translation, notarization or authentication, travel health insurance, additional courier charge\/conveyance for collection or delivery.<\/li>\n<li>Payments made online for any of the services through electronic payment gateway are subject to your agreement to the separate terms and conditions provided by the payment gateway facilitator. You must comply with the particular payment gateway related terms and conditions before proceeding to online payments.<\/li>\n<li>Payments made through online payment system &#8211; through internet banking\/electronic payment gateway\/mobile banking may be subject to additional charges\/tax associated with payer’s payment account. These charges are outside VISAThing’s service charges.<\/li>\n<li>Any issue with unsuccessful payment due to technical\/banking network error must be communicated to the respective banking authority. VISAThing has no discretion and\/or authority to resolve the issue.<\/li>\n<li>VISAThing™ will not provide any service (including the lodgment of a visa application) until payment has been made to VISAThing™ in full for that service. VISAThing™ is not responsible for any repercussions of not providing the service in question.<\/li>\n<li>VISAThing™ Service Charges and Visa Fees may change without prior notice.<\/li>\n<li>As soon as the payment is received and a Tracking ID is generated, the client is deemed to have engaged with the service of VISAThing™. Our service is our professional advice, documentation processing expertise and coordinated effort to provide logistics for processing documents from non-resident authorities\/embassies. Once the service has been engaged it cannot be returned, whether or not the client has changed his mind or no longer wishes to utilize it. If a client submits a refund request before the application\/documents has been dispatched\/processing has been commenced, they may be entitled to a partial refund subject to the discretion of VISAThing™.<\/li>\n<li>If a client pays to avail consultancy service to VISAThing™ to assess documents\/ prepare a visa application pack or any other service in connection with lodgement and change their mind, the fee is non-refundable. In some cases, a credit for the balance of the fee paid (after an assessment of costs for work carried out to date) may be put towards a future visa application for the client.<\/li>\n<li>Should you withdraw a visa application that you have kept on hold for a period longer than 3 months, even if that application might have never been submitted to the Immigration Authorities will be excluded from our visa application system and no further service will be commenced on it.<\/li>\n<li>VISAThing™ operates a strict no refund policy for all ancillary services\/products. In cases of unsuccessful submission attempt\/withdrawal of service only the visa fee will be refunded. The refund must be made to your bank account.<\/li>\n<li>No refund is forthcoming of any fees paid to VISAThing™ where the visa application has been lodged to the Immigration Authorities regardless of the reason for withdrawal.<\/li>\n<li>For short stay business and tourist visas, VISAThing™ may apply and pay for a Double or Multiple entry visa on the Client\/Service Recipient(s) behalf, yet the embassy may decide to grant a Single-entry visa. The decision to grant a Single-entry visa remains solely with the embassy\/consular office and VISAThing™ do not have any discretion over this. No refund of visa fee will be applicable.<\/li>\n<\/ul>\n<\/li>\n<\/ol>\n<p><u> <\/u><\/p>\n<ol start=\"8\">\n<li><strong><u>Terms on Liability<\/u><\/strong>\n<ul>\n<li>It is the client’s own responsibility to ensure that he familiarizes himself with his visa activation date and that the client enters the country to activate his visa before the visa activation date passes. The client’s visa is liable to be cancelled once the visa expiration date passes if the client has not entered before this date. The client bears all responsibility and liability in such situations.<\/li>\n<li>VISAThing™ bears no responsibility or liability for you breaking any existing visa terms and conditions (including overstaying) that you hold or previously held which results in you subsequently becoming illegal in another country. It is your responsibility to ensure that you remain legal at all times while you are in another country.<\/li>\n<li>VISAThing™ will not be held responsible for any loss or damage caused by an embassy\/consulate issuing an incorrect visa or incorrect details on a visa as this is out of our control.<\/li>\n<li>VISAThing™ shall not be held responsible under any circumstance to compensate you for any loss, damage or delay of passports or travel documents by any third-party courier\/delivery company.<\/li>\n<li>VISAThing™ cannot be held responsible for incorrect details on a visa as it is the client&#8217;s responsibility to check the received Visa Grant Notification letter and make sure that the passport details on the visa letter appear exactly as they appear on the passport. Please note that failure to do so may result in significant delays\/missed flights\/additional travel expenses\/not being allowed to enter the relevant country. VISAThing™ should not be held responsible for costs incurred as a result of not following the above obligation.<\/li>\n<li>As our client it is your responsibility to declare any facts which may adversely affect your case via an email prior to engaging our services. This may include but is not limited to previous visa refusal, record of fraudulence\/overstay, serious medical conditions, serious criminal convictions. Non-disclosure of such pertinent facts may result in the visa application being delayed or refused.<\/li>\n<li>A visa may be cancelled at any point in time after the visa grant letter is issued if it is discovered that the information provided to VISAThing™ and in turn to the immigration authorities for the purposes of the visa application is deemed to be false and\/or misleading information. In the event of a visa being cancelled on such grounds, VISAThing™ will bear no responsibility for any costs, grievances, liabilities or any other outcomes suffered by the Client\/Service Recipient(s) that results from the cancellation of a visa application arranged through VISAThing™<\/li>\n<li>The provision of visa services from VISAThing™ to a client ends as soon as a decision is reached by an authorized immigration officer on a visa application. No further work or services will be provided or included from VISAThing™ to the client as part of the visa service provision unless already included in the original contract. VISAThing™ may from time to time provide information or an opinion to the client outside of the provision of immigration visas services. This information may include but is not limited to information relating to travel and visa entry dates, travel options, flight routes, accommodation, geography, and general information about life in another country. None of this information or opinion shall be considered to be part of the service. VISAThing™ will not be held responsible for any inaccuracies or unsuitability of such information. It is the client’s own responsibility to review and confirm for himself the accuracy and suitability of any such information.<\/li>\n<li>Where a visa service or an ancillary service is provided to a client via a franchise executive, the executive\/agent is responsible for taking the initial information and payment. Information received by VISAThing™ from the agent is understood to be true and complete. Should the client provide conflicting information at a later date to VISAThing™, VISAThing™ will not be responsible for the result of the application.<\/li>\n<li>VISAThing™ reserves the right to return any passport without the requested visa if the passport or the documents provided do not comply with the immigration requirements or if there is insufficient time to process the visa.<\/li>\n<li>In the event of loss or damage to any passport or documents in transit through Courier or at the embassy\/consulate\/immigration offices, VISAThing™ will not be entitled to any liability for the consequential loss.<\/li>\n<li>VISAThing™ cannot be held responsible for any expense and\/or delay arising from incomplete application forms, inaccurate\/false or incomplete information provided or inaccurate\/false or incomplete supporting documentation.<\/li>\n<li>VISAThing™ cannot lodge a visa application until it has complete documentation as outlined in the registration pack and any subsequent documentation requested by VISAThing™ from the main applicant. It is the client’s responsibility to ensure that the documentation provided to VISAThing™ at the time of submitting a visa application are valid, up to date and within date.<\/li>\n<li>VISAThing™ will always lodge a visa application in the applicants’ best interest. VISAThing™ does not have authority to grant a visa\/permit of any kind. We cannot guarantee a positive result on a visa application or any assessment or review in arriving at the final result, which is part of the visa process. The final decision on all applications rests with the relevant authority responsible for issuing that result.<\/li>\n<li>It is the client&#8217;s responsibility to provide VISAThing™ with all required information and documentation concerning an application. This may include but is not limited to documentation from third parties such as partners, family, employers, sponsors, assessment bodies, educational bodies, etc. If the required documentation does not meet with the requirements of VISAThing™, VISAThing™ retains the right not to lodge that visa application until it has received all of the required information in order to do so.<\/li>\n<li>In the event where immigration advice provided by one immigration officer \/ consular official conflicts with that of a visa issuing immigration officer at the port of entry, such conflicting information is outside the control of VISAThing™. VISAThing™ will not be liable for any visa application being refused or any additional costs arising from such a refusal (including travel costs) should situations of conflicting information between immigration officers arise.<\/li>\n<li>VISAThing™ advises its Client\/Service Recipient(s) on visa options and applies for visa applications on their behalf in good faith based on immigration information made available directly by immigration and embassy departments at the time of lodgement. In the event where immigration laws and\/or regulations have been updated by an immigration department but such updates have not made known to the public at the time of visa lodgement such conflicting information is outside the control of VISAThing™. VISAThing™ will not be liable for any visa application being refused or any additional costs arising from such a refusal (including travel costs) should situations of outdated information arise.<\/li>\n<li>The immigration authority\/officer has the sole decision on the term of a visa that they grant. This term may be less than the term expected or requested by the client. Similarly, the immigration authority\/ officer has the sole decision on the activation date that they place on a granted visa. This date may be prior to the date expected or requested by the client. VISAThing™ is not responsible for the term of any visa issued or the activation date placed on a visa by an immigration authority even. VISAThing™ has no authority or control to change this term\/date.<\/li>\n<\/ul>\n<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<ol start=\"8\">\n<li><strong>Complaints Handling <\/strong><\/li>\n<\/ol>\n<p>If a Client has a dispute, query or problem, he\/she must contact VISAThing™ directly within 24 hours of the event. Should the client at any time feel that he\/she is dissatisfied with our service, or feel in any way that VISAThing™ has not lived up to his expectations the Client may send a complaint to us in writing via mail or email. This will be passed immediately onto the management. VISAThing™ will handle the complaint in the shortest possible time.<\/p>\n<ol start=\"10\">\n<li><strong>Copyright Issue <\/strong><\/li>\n<\/ol>\n<p>The Client understands that the graphic\/non graphic elements of the application form and money receipt even whereas VISAThing™ mark is used, is the registered trademark of VISAThing™. No user\/client has the rights to such alter; temper contained therein.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Acceptance of Agreement by Client\/ Representative of Group of Client\/Service Recipient(s) <\/strong><\/p>\n<p>I hereinafter understand and express my full consent and acceptance to the contents of the terms and conditions, should that be executed. Therefore, authorize to act on my behalf to store my passports, documents and other information; to process the documents and as and when necessary; to apply and acquire Passport Transit Approval from the Ministry of Home Affairs; Transit my passports and document, submit to and collect from the Embassy, Consulate, High commission, Visa Office or travel agent as and when required. I declare that the foregoing statement is true and correct to the best of my knowledge and belief.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Important – Please Read the Terms and Conditions Thoroughly and Carefully. Availing Any Service from VISAThing™ Is Subject to Complete Acceptance of the Terms and Conditions set out below: &nbsp; General Terms VISAThing™ – a registered trademark of Your Trip Mate Ltd trading as VISAThing™ (herein after called VISAThing™) acts as a visa service provider [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"yst_prominent_words":[740,402,738,736,739,743,604,742,737,735,691,741,734,732,331,286,733,730,744,731],"_links":{"self":[{"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/pages\/5662"}],"collection":[{"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/comments?post=5662"}],"version-history":[{"count":1,"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/pages\/5662\/revisions"}],"predecessor-version":[{"id":5663,"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/pages\/5662\/revisions\/5663"}],"wp:attachment":[{"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/media?parent=5662"}],"wp:term":[{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/visathing.com\/wp-json\/wp\/v2\/yst_prominent_words?post=5662"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}